### 📦 Plan for `sbx/eu-west-1/infra-01/cluster-01/010_eks`
```hcl
04:49:03.747 STDOUT terraform: Terraform used the selected providers to generate the following execution
04:49:03.747 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
04:49:03.747 STDOUT terraform:   + create
04:49:03.747 STDOUT terraform:  <= read (data resources)
04:49:03.747 STDOUT terraform: Terraform will perform the following actions:
04:49:03.747 STDOUT terraform:   # aws_ec2_tag.karpenter_public["subnet-1"] will be created
04:49:03.748 STDOUT terraform:   + resource "aws_ec2_tag" "karpenter_public" {
04:49:03.748 STDOUT terraform:       + id          = (known after apply)
04:49:03.748 STDOUT terraform:       + key         = "karpenter.sh/discovery"
04:49:03.748 STDOUT terraform:       + resource_id = "subnet-1"
04:49:03.748 STDOUT terraform:       + value       = "sbx-dev-eu-west-1-cluster-01-infra-01"
04:49:03.748 STDOUT terraform:     }
04:49:03.748 STDOUT terraform:   # aws_ec2_tag.karpenter_public["subnet-2"] will be created
04:49:03.748 STDOUT terraform:   + resource "aws_ec2_tag" "karpenter_public" {
04:49:03.748 STDOUT terraform:       + id          = (known after apply)
04:49:03.748 STDOUT terraform:       + key         = "karpenter.sh/discovery"
04:49:03.748 STDOUT terraform:       + resource_id = "subnet-2"
04:49:03.748 STDOUT terraform:       + value       = "sbx-dev-eu-west-1-cluster-01-infra-01"
04:49:03.748 STDOUT terraform:     }
04:49:03.748 STDOUT terraform:   # aws_ec2_tag.karpenter_public["subnet-3"] will be created
04:49:03.748 STDOUT terraform:   + resource "aws_ec2_tag" "karpenter_public" {
04:49:03.748 STDOUT terraform:       + id          = (known after apply)
04:49:03.748 STDOUT terraform:       + key         = "karpenter.sh/discovery"
04:49:03.748 STDOUT terraform:       + resource_id = "subnet-3"
04:49:03.748 STDOUT terraform:       + value       = "sbx-dev-eu-west-1-cluster-01-infra-01"
04:49:03.748 STDOUT terraform:     }
04:49:03.748 STDOUT terraform:   # aws_route53_record.ns will be created
04:49:03.748 STDOUT terraform:   + resource "aws_route53_record" "ns" {
04:49:03.748 STDOUT terraform:       + allow_overwrite = (known after apply)
04:49:03.748 STDOUT terraform:       + fqdn            = (known after apply)
04:49:03.748 STDOUT terraform:       + id              = (known after apply)
04:49:03.748 STDOUT terraform:       + name            = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
04:49:03.748 STDOUT terraform:       + records         = (known after apply)
04:49:03.748 STDOUT terraform:       + ttl             = 300
04:49:03.748 STDOUT terraform:       + type            = "NS"
04:49:03.748 STDOUT terraform:       + zone_id         = "Z007063513EIRKOFIWQ9J"
04:49:03.748 STDOUT terraform:     }
04:49:03.748 STDOUT terraform:   # aws_route53_zone.cluster_zone will be created
04:49:03.749 STDOUT terraform:   + resource "aws_route53_zone" "cluster_zone" {
04:49:03.749 STDOUT terraform:       + arn                 = (known after apply)
04:49:03.749 STDOUT terraform:       + comment             = "Separate zone for sbx-dev-eu-west-1-cluster-01-infra-01 cluster"
04:49:03.749 STDOUT terraform:       + force_destroy       = true
04:49:03.749 STDOUT terraform:       + id                  = (known after apply)
04:49:03.749 STDOUT terraform:       + name                = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
04:49:03.749 STDOUT terraform:       + name_servers        = (known after apply)
04:49:03.749 STDOUT terraform:       + primary_name_server = (known after apply)
04:49:03.749 STDOUT terraform:       + tags                = (known after apply)
04:49:03.749 STDOUT terraform:       + tags_all            = (known after apply)
04:49:03.749 STDOUT terraform:       + zone_id             = (known after apply)
04:49:03.749 STDOUT terraform:     }
04:49:03.749 STDOUT terraform:   # module.certificate.aws_acm_certificate.this[0] will be created
04:49:03.749 STDOUT terraform:   + resource "aws_acm_certificate" "this" {
04:49:03.749 STDOUT terraform:       + arn                       = (known after apply)
04:49:03.749 STDOUT terraform:       + domain_name               = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
04:49:03.749 STDOUT terraform:       + domain_validation_options = [
04:49:03.749 STDOUT terraform:           + {
04:49:03.749 STDOUT terraform:               + domain_name           = "*.sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
04:49:03.749 STDOUT terraform:               + resource_record_name  = (known after apply)
04:49:03.749 STDOUT terraform:               + resource_record_type  = (known after apply)
04:49:03.749 STDOUT terraform:               + resource_record_value = (known after apply)
04:49:03.749 STDOUT terraform:             },
04:49:03.749 STDOUT terraform:           + {
04:49:03.749 STDOUT terraform:               + domain_name           = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
04:49:03.749 STDOUT terraform:               + resource_record_name  = (known after apply)
04:49:03.749 STDOUT terraform:               + resource_record_type  = (known after apply)
04:49:03.749 STDOUT terraform:               + resource_record_value = (known after apply)
04:49:03.750 STDOUT terraform:             },
04:49:03.750 STDOUT terraform:         ]
04:49:03.750 STDOUT terraform:       + id                        = (known after apply)
04:49:03.750 STDOUT terraform:       + key_algorithm             = (known after apply)
04:49:03.750 STDOUT terraform:       + not_after                 = (known after apply)
04:49:03.750 STDOUT terraform:       + not_before                = (known after apply)
04:49:03.750 STDOUT terraform:       + pending_renewal           = (known after apply)
04:49:03.750 STDOUT terraform:       + renewal_eligibility       = (known after apply)
04:49:03.750 STDOUT terraform:       + renewal_summary           = (known after apply)
04:49:03.750 STDOUT terraform:       + status                    = (known after apply)
04:49:03.750 STDOUT terraform:       + subject_alternative_names = [
04:49:03.750 STDOUT terraform:           + "*.sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com",
04:49:03.750 STDOUT terraform:           + "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com",
04:49:03.750 STDOUT terraform:         ]
04:49:03.750 STDOUT terraform:       + tags                      = {
04:49:03.750 STDOUT terraform:           + "Environment" = "dev"
04:49:03.750 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.750 STDOUT terraform:         }
04:49:03.750 STDOUT terraform:       + tags_all                  = {
04:49:03.750 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.750 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.750 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.750 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.750 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.750 STDOUT terraform:         }
04:49:03.750 STDOUT terraform:       + type                      = (known after apply)
04:49:03.750 STDOUT terraform:       + validation_emails         = (known after apply)
04:49:03.750 STDOUT terraform:       + validation_method         = "DNS"
04:49:03.750 STDOUT terraform:       + options {
04:49:03.750 STDOUT terraform:           + certificate_transparency_logging_preference = "ENABLED"
04:49:03.750 STDOUT terraform:         }
04:49:03.750 STDOUT terraform:     }
04:49:03.750 STDOUT terraform:   # module.certificate.aws_acm_certificate_validation.this[0] will be created
04:49:03.750 STDOUT terraform:   + resource "aws_acm_certificate_validation" "this" {
04:49:03.750 STDOUT terraform:       + certificate_arn         = (known after apply)
04:49:03.750 STDOUT terraform:       + id                      = (known after apply)
04:49:03.750 STDOUT terraform:       + validation_record_fqdns = (known after apply)
04:49:03.750 STDOUT terraform:       + timeouts {}
04:49:03.750 STDOUT terraform:     }
04:49:03.750 STDOUT terraform:   # module.certificate.aws_route53_record.validation[0] will be created
04:49:03.751 STDOUT terraform:   + resource "aws_route53_record" "validation" {
04:49:03.751 STDOUT terraform:       + allow_overwrite = true
04:49:03.751 STDOUT terraform:       + fqdn            = (known after apply)
04:49:03.751 STDOUT terraform:       + id              = (known after apply)
04:49:03.751 STDOUT terraform:       + name            = (known after apply)
04:49:03.751 STDOUT terraform:       + records         = (known after apply)
04:49:03.751 STDOUT terraform:       + ttl             = 60
04:49:03.751 STDOUT terraform:       + type            = (known after apply)
04:49:03.751 STDOUT terraform:       + zone_id         = (known after apply)
04:49:03.751 STDOUT terraform:     }
04:49:03.751 STDOUT terraform:   # module.cluster.data.tls_certificate.this[0] will be read during apply
04:49:03.751 STDOUT terraform:   # (config refers to values not yet known)
04:49:03.751 STDOUT terraform:  <= data "tls_certificate" "this" {
04:49:03.751 STDOUT terraform:       + certificates = (known after apply)
04:49:03.751 STDOUT terraform:       + id           = (known after apply)
04:49:03.751 STDOUT terraform:       + url          = (known after apply)
04:49:03.751 STDOUT terraform:     }
04:49:03.751 STDOUT terraform:   # module.cluster.aws_cloudwatch_log_group.this[0] will be created
04:49:03.751 STDOUT terraform:   + resource "aws_cloudwatch_log_group" "this" {
04:49:03.751 STDOUT terraform:       + arn               = (known after apply)
04:49:03.751 STDOUT terraform:       + id                = (known after apply)
04:49:03.751 STDOUT terraform:       + log_group_class   = (known after apply)
04:49:03.751 STDOUT terraform:       + name              = "/aws/eks/sbx-dev-eu-west-1-cluster-01-infra-01/cluster"
04:49:03.751 STDOUT terraform:       + name_prefix       = (known after apply)
04:49:03.751 STDOUT terraform:       + retention_in_days = 90
04:49:03.751 STDOUT terraform:       + skip_destroy      = false
04:49:03.751 STDOUT terraform:       + tags              = {
04:49:03.751 STDOUT terraform:           + "Environment" = "dev"
04:49:03.751 STDOUT terraform:           + "Name"        = "/aws/eks/sbx-dev-eu-west-1-cluster-01-infra-01/cluster"
04:49:03.751 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.751 STDOUT terraform:         }
04:49:03.751 STDOUT terraform:       + tags_all          = {
04:49:03.751 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.751 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.751 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.751 STDOUT terraform:           + "Name"                = "/aws/eks/sbx-dev-eu-west-1-cluster-01-infra-01/cluster"
04:49:03.751 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.751 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.752 STDOUT terraform:         }
04:49:03.752 STDOUT terraform:     }
04:49:03.752 STDOUT terraform:   # module.cluster.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
04:49:03.752 STDOUT terraform:   + resource "aws_ec2_tag" "cluster_primary_security_group" {
04:49:03.752 STDOUT terraform:       + id          = (known after apply)
04:49:03.752 STDOUT terraform:       + key         = "Environment"
04:49:03.752 STDOUT terraform:       + resource_id = (known after apply)
04:49:03.752 STDOUT terraform:       + value       = "dev"
04:49:03.752 STDOUT terraform:     }
04:49:03.752 STDOUT terraform:   # module.cluster.aws_ec2_tag.cluster_primary_security_group["Terragrunt"] will be created
04:49:03.752 STDOUT terraform:   + resource "aws_ec2_tag" "cluster_primary_security_group" {
04:49:03.752 STDOUT terraform:       + id          = (known after apply)
04:49:03.752 STDOUT terraform:       + key         = "Terragrunt"
04:49:03.752 STDOUT terraform:       + resource_id = (known after apply)
04:49:03.752 STDOUT terraform:       + value       = "true"
04:49:03.752 STDOUT terraform:     }
04:49:03.752 STDOUT terraform:   # module.cluster.aws_eks_access_entry.this["CrossplaneRole"] will be created
04:49:03.752 STDOUT terraform:   + resource "aws_eks_access_entry" "this" {
04:49:03.752 STDOUT terraform:       + access_entry_arn  = (known after apply)
04:49:03.752 STDOUT terraform:       + cluster_name      = (known after apply)
04:49:03.752 STDOUT terraform:       + created_at        = (known after apply)
04:49:03.752 STDOUT terraform:       + id                = (known after apply)
04:49:03.752 STDOUT terraform:       + kubernetes_groups = [
04:49:03.752 STDOUT terraform:           + "viewer-group",
04:49:03.752 STDOUT terraform:         ]
04:49:03.752 STDOUT terraform:       + modified_at       = (known after apply)
04:49:03.752 STDOUT terraform:       + principal_arn     = "arn:aws:iam::955769636964:role/CrossplaneRole"
04:49:03.752 STDOUT terraform:       + tags              = {
04:49:03.752 STDOUT terraform:           + "Environment" = "dev"
04:49:03.752 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.752 STDOUT terraform:         }
04:49:03.752 STDOUT terraform:       + tags_all          = {
04:49:03.752 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.752 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.752 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.752 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.752 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.752 STDOUT terraform:         }
04:49:03.752 STDOUT terraform:       + type              = "STANDARD"
04:49:03.752 STDOUT terraform:       + user_name         = (known after apply)
04:49:03.752 STDOUT terraform:     }
04:49:03.752 STDOUT terraform:   # module.cluster.aws_eks_access_entry.this["Terraform"] will be created
04:49:03.752 STDOUT terraform:   + resource "aws_eks_access_entry" "this" {
04:49:03.753 STDOUT terraform:       + access_entry_arn  = (known after apply)
04:49:03.753 STDOUT terraform:       + cluster_name      = (known after apply)
04:49:03.753 STDOUT terraform:       + created_at        = (known after apply)
04:49:03.753 STDOUT terraform:       + id                = (known after apply)
04:49:03.753 STDOUT terraform:       + kubernetes_groups = [
04:49:03.753 STDOUT terraform:           + "viewer-group",
04:49:03.753 STDOUT terraform:         ]
04:49:03.753 STDOUT terraform:       + modified_at       = (known after apply)
04:49:03.753 STDOUT terraform:       + principal_arn     = "arn:aws:iam::955769636964:user/Terraform"
04:49:03.753 STDOUT terraform:       + tags              = {
04:49:03.753 STDOUT terraform:           + "Environment" = "dev"
04:49:03.753 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.753 STDOUT terraform:         }
04:49:03.753 STDOUT terraform:       + tags_all          = {
04:49:03.753 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.753 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.753 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.753 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.753 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.753 STDOUT terraform:         }
04:49:03.753 STDOUT terraform:       + type              = "STANDARD"
04:49:03.753 STDOUT terraform:       + user_name         = (known after apply)
04:49:03.753 STDOUT terraform:     }
04:49:03.753 STDOUT terraform:   # module.cluster.aws_eks_access_entry.this["cluster_creator"] will be created
04:49:03.753 STDOUT terraform:   + resource "aws_eks_access_entry" "this" {
04:49:03.753 STDOUT terraform:       + access_entry_arn  = (known after apply)
04:49:03.753 STDOUT terraform:       + cluster_name      = (known after apply)
04:49:03.753 STDOUT terraform:       + created_at        = (known after apply)
04:49:03.753 STDOUT terraform:       + id                = (known after apply)
04:49:03.753 STDOUT terraform:       + kubernetes_groups = (known after apply)
04:49:03.753 STDOUT terraform:       + modified_at       = (known after apply)
04:49:03.753 STDOUT terraform:       + principal_arn     = "arn:aws:iam::955769636964:role/deployment-terragrunt-genopsx-eu-west-1-955769636964"
04:49:03.753 STDOUT terraform:       + tags              = {
04:49:03.753 STDOUT terraform:           + "Environment" = "dev"
04:49:03.753 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.753 STDOUT terraform:         }
04:49:03.753 STDOUT terraform:       + tags_all          = {
04:49:03.753 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.753 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.753 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.753 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.753 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.753 STDOUT terraform:         }
04:49:03.753 STDOUT terraform:       + type              = "STANDARD"
04:49:03.753 STDOUT terraform:       + user_name         = (known after apply)
04:49:03.753 STDOUT terraform:     }
04:49:03.753 STDOUT terraform:   # module.cluster.aws_eks_access_entry.this["eks-admin-role"] will be created
04:49:03.753 STDOUT terraform:   + resource "aws_eks_access_entry" "this" {
04:49:03.753 STDOUT terraform:       + access_entry_arn  = (known after apply)
04:49:03.753 STDOUT terraform:       + cluster_name      = (known after apply)
04:49:03.754 STDOUT terraform:       + created_at        = (known after apply)
04:49:03.754 STDOUT terraform:       + id                = (known after apply)
04:49:03.754 STDOUT terraform:       + kubernetes_groups = [
04:49:03.754 STDOUT terraform:           + "developer-group",
04:49:03.754 STDOUT terraform:         ]
04:49:03.754 STDOUT terraform:       + modified_at       = (known after apply)
04:49:03.754 STDOUT terraform:       + principal_arn     = "arn:aws:iam::955769636964:role/eks-admin-role"
04:49:03.754 STDOUT terraform:       + tags              = {
04:49:03.754 STDOUT terraform:           + "Environment" = "dev"
04:49:03.754 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.754 STDOUT terraform:         }
04:49:03.754 STDOUT terraform:       + tags_all          = {
04:49:03.754 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.754 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.754 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.754 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.754 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.754 STDOUT terraform:         }
04:49:03.754 STDOUT terraform:       + type              = "STANDARD"
04:49:03.754 STDOUT terraform:       + user_name         = (known after apply)
04:49:03.754 STDOUT terraform:     }
04:49:03.754 STDOUT terraform:   # module.cluster.aws_eks_access_policy_association.this["CrossplaneRole_role"] will be created
04:49:03.754 STDOUT terraform:   + resource "aws_eks_access_policy_association" "this" {
04:49:03.754 STDOUT terraform:       + associated_at = (known after apply)
04:49:03.754 STDOUT terraform:       + cluster_name  = (known after apply)
04:49:03.754 STDOUT terraform:       + id            = (known after apply)
04:49:03.754 STDOUT terraform:       + modified_at   = (known after apply)
04:49:03.754 STDOUT terraform:       + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSViewPolicy"
04:49:03.754 STDOUT terraform:       + principal_arn = "arn:aws:iam::955769636964:role/CrossplaneRole"
04:49:03.754 STDOUT terraform:       + access_scope {
04:49:03.754 STDOUT terraform:           + namespaces = [
04:49:03.754 STDOUT terraform:               + "kube-system",
04:49:03.754 STDOUT terraform:             ]
04:49:03.754 STDOUT terraform:           + type       = "namespace"
04:49:03.754 STDOUT terraform:         }
04:49:03.754 STDOUT terraform:     }
04:49:03.754 STDOUT terraform:   # module.cluster.aws_eks_access_policy_association.this["Terraform_user"] will be created
04:49:03.754 STDOUT terraform:   + resource "aws_eks_access_policy_association" "this" {
04:49:03.754 STDOUT terraform:       + associated_at = (known after apply)
04:49:03.754 STDOUT terraform:       + cluster_name  = (known after apply)
04:49:03.754 STDOUT terraform:       + id            = (known after apply)
04:49:03.754 STDOUT terraform:       + modified_at   = (known after apply)
04:49:03.754 STDOUT terraform:       + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSViewPolicy"
04:49:03.754 STDOUT terraform:       + principal_arn = "arn:aws:iam::955769636964:user/Terraform"
04:49:03.754 STDOUT terraform:       + access_scope {
04:49:03.755 STDOUT terraform:           + namespaces = [
04:49:03.755 STDOUT terraform:               + "kube-system",
04:49:03.755 STDOUT terraform:             ]
04:49:03.755 STDOUT terraform:           + type       = "namespace"
04:49:03.755 STDOUT terraform:         }
04:49:03.755 STDOUT terraform:     }
04:49:03.755 STDOUT terraform:   # module.cluster.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
04:49:03.755 STDOUT terraform:   + resource "aws_eks_access_policy_association" "this" {
04:49:03.755 STDOUT terraform:       + associated_at = (known after apply)
04:49:03.755 STDOUT terraform:       + cluster_name  = (known after apply)
04:49:03.755 STDOUT terraform:       + id            = (known after apply)
04:49:03.755 STDOUT terraform:       + modified_at   = (known after apply)
04:49:03.755 STDOUT terraform:       + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
04:49:03.755 STDOUT terraform:       + principal_arn = "arn:aws:iam::955769636964:role/deployment-terragrunt-genopsx-eu-west-1-955769636964"
04:49:03.755 STDOUT terraform:       + access_scope {
04:49:03.755 STDOUT terraform:           + type = "cluster"
04:49:03.755 STDOUT terraform:         }
04:49:03.755 STDOUT terraform:     }
04:49:03.755 STDOUT terraform:   # module.cluster.aws_eks_access_policy_association.this["eks-admin-role_role"] will be created
04:49:03.755 STDOUT terraform:   + resource "aws_eks_access_policy_association" "this" {
04:49:03.755 STDOUT terraform:       + associated_at = (known after apply)
04:49:03.755 STDOUT terraform:       + cluster_name  = (known after apply)
04:49:03.755 STDOUT terraform:       + id            = (known after apply)
04:49:03.755 STDOUT terraform:       + modified_at   = (known after apply)
04:49:03.755 STDOUT terraform:       + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
04:49:03.755 STDOUT terraform:       + principal_arn = "arn:aws:iam::955769636964:role/eks-admin-role"
04:49:03.755 STDOUT terraform:       + access_scope {
04:49:03.755 STDOUT terraform:           + type = "cluster"
04:49:03.755 STDOUT terraform:         }
04:49:03.755 STDOUT terraform:     }
04:49:03.755 STDOUT terraform:   # module.cluster.aws_eks_cluster.this[0] will be created
04:49:03.755 STDOUT terraform:   + resource "aws_eks_cluster" "this" {
04:49:03.755 STDOUT terraform:       + arn                           = (known after apply)
04:49:03.755 STDOUT terraform:       + bootstrap_self_managed_addons = true
04:49:03.755 STDOUT terraform:       + certificate_authority         = (known after apply)
04:49:03.755 STDOUT terraform:       + cluster_id                    = (known after apply)
04:49:03.756 STDOUT terraform:       + created_at                    = (known after apply)
04:49:03.756 STDOUT terraform:       + enabled_cluster_log_types     = [
04:49:03.756 STDOUT terraform:           + "api",
04:49:03.756 STDOUT terraform:           + "audit",
04:49:03.756 STDOUT terraform:           + "authenticator",
04:49:03.756 STDOUT terraform:           + "controllerManager",
04:49:03.756 STDOUT terraform:           + "scheduler",
04:49:03.756 STDOUT terraform:         ]
04:49:03.756 STDOUT terraform:       + endpoint                      = (known after apply)
04:49:03.756 STDOUT terraform:       + id                            = (known after apply)
04:49:03.756 STDOUT terraform:       + identity                      = (known after apply)
04:49:03.756 STDOUT terraform:       + name                          = "sbx-dev-eu-west-1-cluster-01-infra-01"
04:49:03.756 STDOUT terraform:       + platform_version              = (known after apply)
04:49:03.756 STDOUT terraform:       + role_arn                      = (known after apply)
04:49:03.756 STDOUT terraform:       + status                        = (known after apply)
04:49:03.756 STDOUT terraform:       + tags                          = {
04:49:03.756 STDOUT terraform:           + "Environment"           = "dev"
04:49:03.756 STDOUT terraform:           + "Terragrunt"            = "true"
04:49:03.756 STDOUT terraform:           + "terraform-aws-modules" = "eks"
04:49:03.756 STDOUT terraform:         }
04:49:03.756 STDOUT terraform:       + tags_all                      = {
04:49:03.756 STDOUT terraform:           + "Data-classification"   = "internal"
04:49:03.756 STDOUT terraform:           + "Environment"           = "dev"
04:49:03.756 STDOUT terraform:           + "Managed-by"            = "terragrunt"
04:49:03.756 STDOUT terraform:           + "Organization"          = "genopsx"
04:49:03.756 STDOUT terraform:           + "Terragrunt"            = "true"
04:49:03.756 STDOUT terraform:           + "terraform-aws-modules" = "eks"
04:49:03.756 STDOUT terraform:         }
04:49:03.756 STDOUT terraform:       + version                       = "1.31"
04:49:03.756 STDOUT terraform:       + access_config {
04:49:03.756 STDOUT terraform:           + authentication_mode                         = "API_AND_CONFIG_MAP"
04:49:03.756 STDOUT terraform:           + bootstrap_cluster_creator_admin_permissions = false
04:49:03.756 STDOUT terraform:         }
04:49:03.756 STDOUT terraform:       + encryption_config {
04:49:03.756 STDOUT terraform:           + resources = [
04:49:03.757 STDOUT terraform:               + "secrets",
04:49:03.757 STDOUT terraform:             ]
04:49:03.757 STDOUT terraform:           + provider {
04:49:03.757 STDOUT terraform:               + key_arn = (known after apply)
04:49:03.757 STDOUT terraform:             }
04:49:03.757 STDOUT terraform:         }
04:49:03.757 STDOUT terraform:       + kubernetes_network_config {
04:49:03.757 STDOUT terraform:           + ip_family         = "ipv4"
04:49:03.757 STDOUT terraform:           + service_ipv4_cidr = (known after apply)
04:49:03.757 STDOUT terraform:           + service_ipv6_cidr = (known after apply)
04:49:03.757 STDOUT terraform:           + elastic_load_balancing (known after apply)
04:49:03.757 STDOUT terraform:         }
04:49:03.757 STDOUT terraform:       + timeouts {}
04:49:03.757 STDOUT terraform:       + upgrade_policy (known after apply)
04:49:03.757 STDOUT terraform:       + vpc_config {
04:49:03.757 STDOUT terraform:           + cluster_security_group_id = (known after apply)
04:49:03.757 STDOUT terraform:           + endpoint_private_access   = false
04:49:03.757 STDOUT terraform:           + endpoint_public_access    = true
04:49:03.757 STDOUT terraform:           + public_access_cidrs       = [
04:49:03.757 STDOUT terraform:               + "0.0.0.0/0",
04:49:03.757 STDOUT terraform:             ]
04:49:03.757 STDOUT terraform:           + security_group_ids        = (known after apply)
04:49:03.757 STDOUT terraform:           + subnet_ids                = [
04:49:03.757 STDOUT terraform:               + "subnet-1",
04:49:03.757 STDOUT terraform:               + "subnet-2",
04:49:03.757 STDOUT terraform:               + "subnet-3",
04:49:03.757 STDOUT terraform:               + "subnet-4",
04:49:03.757 STDOUT terraform:               + "subnet-5",
04:49:03.757 STDOUT terraform:               + "subnet-6",
04:49:03.757 STDOUT terraform:             ]
04:49:03.757 STDOUT terraform:           + vpc_id                    = (known after apply)
04:49:03.757 STDOUT terraform:         }
04:49:03.757 STDOUT terraform:     }
04:49:03.757 STDOUT terraform:   # module.cluster.aws_iam_openid_connect_provider.oidc_provider[0] will be created
04:49:03.757 STDOUT terraform:   + resource "aws_iam_openid_connect_provider" "oidc_provider" {
04:49:03.757 STDOUT terraform:       + arn             = (known after apply)
04:49:03.757 STDOUT terraform:       + client_id_list  = [
04:49:03.757 STDOUT terraform:           + "sts.amazonaws.com",
04:49:03.757 STDOUT terraform:         ]
04:49:03.757 STDOUT terraform:       + id              = (known after apply)
04:49:03.757 STDOUT terraform:       + tags            = {
04:49:03.757 STDOUT terraform:           + "Environment" = "dev"
04:49:03.757 STDOUT terraform:           + "Name"        = "sbx-dev-eu-west-1-cluster-01-infra-01-eks-irsa"
04:49:03.757 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.757 STDOUT terraform:         }
04:49:03.757 STDOUT terraform:       + tags_all        = {
04:49:03.757 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.757 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.757 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.757 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-cluster-01-infra-01-eks-irsa"
04:49:03.757 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.757 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.757 STDOUT terraform:         }
04:49:03.757 STDOUT terraform:       + thumbprint_list = (known after apply)
04:49:03.758 STDOUT terraform:       + url             = (known after apply)
04:49:03.758 STDOUT terraform:     }
04:49:03.758 STDOUT terraform:   # module.cluster.aws_iam_policy.cluster_encryption[0] will be created
04:49:03.758 STDOUT terraform:   + resource "aws_iam_policy" "cluster_encryption" {
04:49:03.758 STDOUT terraform:       + arn              = (known after apply)
04:49:03.758 STDOUT terraform:       + attachment_count = (known after apply)
04:49:03.758 STDOUT terraform:       + description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
04:49:03.758 STDOUT terraform:       + id               = (known after apply)
04:49:03.758 STDOUT terraform:       + name             = (known after apply)
04:49:03.758 STDOUT terraform:       + name_prefix      = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster-ClusterEncryption"
04:49:03.758 STDOUT terraform:       + path             = "/"
04:49:03.758 STDOUT terraform:       + policy           = (known after apply)
04:49:03.758 STDOUT terraform:       + policy_id        = (known after apply)
04:49:03.758 STDOUT terraform:       + tags             = {
04:49:03.758 STDOUT terraform:           + "Environment" = "dev"
04:49:03.758 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.758 STDOUT terraform:         }
04:49:03.758 STDOUT terraform:       + tags_all         = {
04:49:03.758 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.758 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.758 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.758 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.758 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.758 STDOUT terraform:         }
04:49:03.758 STDOUT terraform:     }
04:49:03.758 STDOUT terraform:   # module.cluster.aws_iam_role.this[0] will be created
04:49:03.758 STDOUT terraform:   + resource "aws_iam_role" "this" {
04:49:03.758 STDOUT terraform:       + arn                   = (known after apply)
04:49:03.758 STDOUT terraform:       + assume_role_policy    = jsonencode(
04:49:03.758 STDOUT terraform:             {
04:49:03.758 STDOUT terraform:               + Statement = [
04:49:03.758 STDOUT terraform:                   + {
04:49:03.758 STDOUT terraform:                       + Action    = [
04:49:03.758 STDOUT terraform:                           + "sts:TagSession",
04:49:03.758 STDOUT terraform:                           + "sts:AssumeRole",
04:49:03.758 STDOUT terraform:                         ]
04:49:03.758 STDOUT terraform:                       + Effect    = "Allow"
04:49:03.758 STDOUT terraform:                       + Principal = {
04:49:03.758 STDOUT terraform:                           + Service = "eks.amazonaws.com"
04:49:03.759 STDOUT terraform:                         }
04:49:03.759 STDOUT terraform:                       + Sid       = "EKSClusterAssumeRole"
04:49:03.759 STDOUT terraform:                     },
04:49:03.759 STDOUT terraform:                 ]
04:49:03.759 STDOUT terraform:               + Version   = "2012-10-17"
04:49:03.759 STDOUT terraform:             }
04:49:03.759 STDOUT terraform:         )
04:49:03.759 STDOUT terraform:       + create_date           = (known after apply)
04:49:03.759 STDOUT terraform:       + force_detach_policies = true
04:49:03.759 STDOUT terraform:       + id                    = (known after apply)
04:49:03.759 STDOUT terraform:       + managed_policy_arns   = (known after apply)
04:49:03.759 STDOUT terraform:       + max_session_duration  = 3600
04:49:03.759 STDOUT terraform:       + name                  = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
04:49:03.759 STDOUT terraform:       + name_prefix           = (known after apply)
04:49:03.759 STDOUT terraform:       + path                  = "/"
04:49:03.759 STDOUT terraform:       + tags                  = {
04:49:03.759 STDOUT terraform:           + "Environment" = "dev"
04:49:03.759 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.759 STDOUT terraform:         }
04:49:03.759 STDOUT terraform:       + tags_all              = {
04:49:03.759 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.759 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.759 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.759 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.759 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.759 STDOUT terraform:         }
04:49:03.759 STDOUT terraform:       + unique_id             = (known after apply)
04:49:03.759 STDOUT terraform:       + inline_policy (known after apply)
04:49:03.759 STDOUT terraform:     }
04:49:03.759 STDOUT terraform:   # module.cluster.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
04:49:03.760 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
04:49:03.760 STDOUT terraform:       + id         = (known after apply)
04:49:03.760 STDOUT terraform:       + policy_arn = (known after apply)
04:49:03.760 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
04:49:03.760 STDOUT terraform:     }
04:49:03.760 STDOUT terraform:   # module.cluster.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
04:49:03.760 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
04:49:03.760 STDOUT terraform:       + id         = (known after apply)
04:49:03.760 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
04:49:03.760 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
04:49:03.760 STDOUT terraform:     }
04:49:03.760 STDOUT terraform:   # module.cluster.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
04:49:03.760 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
04:49:03.760 STDOUT terraform:       + id         = (known after apply)
04:49:03.760 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
04:49:03.760 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
04:49:03.761 STDOUT terraform:     }
04:49:03.761 STDOUT terraform:   # module.cluster.aws_security_group.cluster[0] will be created
04:49:03.761 STDOUT terraform:   + resource "aws_security_group" "cluster" {
04:49:03.761 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.761 STDOUT terraform:       + description            = "EKS cluster security group"
04:49:03.761 STDOUT terraform:       + egress                 = (known after apply)
04:49:03.761 STDOUT terraform:       + id                     = (known after apply)
04:49:03.761 STDOUT terraform:       + ingress                = (known after apply)
04:49:03.761 STDOUT terraform:       + name                   = (known after apply)
04:49:03.761 STDOUT terraform:       + name_prefix            = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster-"
04:49:03.761 STDOUT terraform:       + owner_id               = (known after apply)
04:49:03.761 STDOUT terraform:       + revoke_rules_on_delete = false
04:49:03.761 STDOUT terraform:       + tags                   = {
04:49:03.761 STDOUT terraform:           + "Environment"                                                 = "dev"
04:49:03.761 STDOUT terraform:           + "Name"                                                        = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
04:49:03.761 STDOUT terraform:           + "Terragrunt"                                                  = "true"
04:49:03.761 STDOUT terraform:           + "kubernetes.io/cluster/sbx-dev-eu-west-1-cluster-01-infra-01" = "owned"
04:49:03.762 STDOUT terraform:         }
04:49:03.762 STDOUT terraform:       + tags_all               = {
04:49:03.762 STDOUT terraform:           + "Data-classification"                                         = "internal"
04:49:03.762 STDOUT terraform:           + "Environment"                                                 = "dev"
04:49:03.762 STDOUT terraform:           + "Managed-by"                                                  = "terragrunt"
04:49:03.762 STDOUT terraform:           + "Name"                                                        = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
04:49:03.762 STDOUT terraform:           + "Organization"                                                = "genopsx"
04:49:03.762 STDOUT terraform:           + "Terragrunt"                                                  = "true"
04:49:03.762 STDOUT terraform:           + "kubernetes.io/cluster/sbx-dev-eu-west-1-cluster-01-infra-01" = "owned"
04:49:03.762 STDOUT terraform:         }
04:49:03.762 STDOUT terraform:       + vpc_id                 = "vpc-1234"
04:49:03.762 STDOUT terraform:     }
04:49:03.762 STDOUT terraform:   # module.cluster.aws_security_group.node[0] will be created
04:49:03.763 STDOUT terraform:   + resource "aws_security_group" "node" {
04:49:03.763 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.763 STDOUT terraform:       + description            = "EKS node shared security group"
04:49:03.763 STDOUT terraform:       + egress                 = (known after apply)
04:49:03.763 STDOUT terraform:       + id                     = (known after apply)
04:49:03.763 STDOUT terraform:       + ingress                = (known after apply)
04:49:03.763 STDOUT terraform:       + name                   = (known after apply)
04:49:03.763 STDOUT terraform:       + name_prefix            = "sbx-dev-eu-west-1-cluster-01-infra-01-node-"
04:49:03.763 STDOUT terraform:       + owner_id               = (known after apply)
04:49:03.763 STDOUT terraform:       + revoke_rules_on_delete = false
04:49:03.763 STDOUT terraform:       + tags                   = {
04:49:03.763 STDOUT terraform:           + "Environment"                                                 = "dev"
04:49:03.763 STDOUT terraform:           + "Name"                                                        = "sbx-dev-eu-west-1-cluster-01-infra-01-node"
04:49:03.763 STDOUT terraform:           + "Terragrunt"                                                  = "true"
04:49:03.763 STDOUT terraform:           + "kubernetes.io/cluster/sbx-dev-eu-west-1-cluster-01-infra-01" = "owned"
04:49:03.764 STDOUT terraform:         }
04:49:03.764 STDOUT terraform:       + tags_all               = {
04:49:03.764 STDOUT terraform:           + "Data-classification"                                         = "internal"
04:49:03.764 STDOUT terraform:           + "Environment"                                                 = "dev"
04:49:03.764 STDOUT terraform:           + "Managed-by"                                                  = "terragrunt"
04:49:03.764 STDOUT terraform:           + "Name"                                                        = "sbx-dev-eu-west-1-cluster-01-infra-01-node"
04:49:03.764 STDOUT terraform:           + "Organization"                                                = "genopsx"
04:49:03.764 STDOUT terraform:           + "Terragrunt"                                                  = "true"
04:49:03.764 STDOUT terraform:           + "kubernetes.io/cluster/sbx-dev-eu-west-1-cluster-01-infra-01" = "owned"
04:49:03.764 STDOUT terraform:         }
04:49:03.764 STDOUT terraform:       + vpc_id                 = "vpc-1234"
04:49:03.764 STDOUT terraform:     }
04:49:03.764 STDOUT terraform:   # module.cluster.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
04:49:03.764 STDOUT terraform:   + resource "aws_security_group_rule" "cluster" {
04:49:03.764 STDOUT terraform:       + description              = "Node groups to cluster API"
04:49:03.764 STDOUT terraform:       + from_port                = 443
04:49:03.764 STDOUT terraform:       + id                       = (known after apply)
04:49:03.764 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.764 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.764 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.764 STDOUT terraform:       + self                     = false
04:49:03.764 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.764 STDOUT terraform:       + to_port                  = 443
04:49:03.764 STDOUT terraform:       + type                     = "ingress"
04:49:03.765 STDOUT terraform:     }
04:49:03.765 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["egress_all"] will be created
04:49:03.765 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
04:49:03.765 STDOUT terraform:       + cidr_blocks              = [
04:49:03.765 STDOUT terraform:           + "0.0.0.0/0",
04:49:03.765 STDOUT terraform:         ]
04:49:03.765 STDOUT terraform:       + description              = "Allow all egress"
04:49:03.765 STDOUT terraform:       + from_port                = 0
04:49:03.765 STDOUT terraform:       + id                       = (known after apply)
04:49:03.765 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.765 STDOUT terraform:       + protocol                 = "-1"
04:49:03.765 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.765 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.765 STDOUT terraform:       + self                     = false
04:49:03.765 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.765 STDOUT terraform:       + to_port                  = 0
04:49:03.765 STDOUT terraform:       + type                     = "egress"
04:49:03.765 STDOUT terraform:     }
04:49:03.765 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_cluster_443"] will be created
04:49:03.765 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
04:49:03.765 STDOUT terraform:       + description              = "Cluster API to node groups"
04:49:03.765 STDOUT terraform:       + from_port                = 443
04:49:03.765 STDOUT terraform:       + id                       = (known after apply)
04:49:03.765 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.765 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.765 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.765 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.765 STDOUT terraform:       + self                     = false
04:49:03.765 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.765 STDOUT terraform:       + to_port                  = 443
04:49:03.765 STDOUT terraform:       + type                     = "ingress"
04:49:03.765 STDOUT terraform:     }
04:49:03.765 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
04:49:03.765 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
04:49:03.765 STDOUT terraform:       + description              = "Cluster API to node 4443/tcp webhook"
04:49:03.765 STDOUT terraform:       + from_port                = 4443
04:49:03.765 STDOUT terraform:       + id                       = (known after apply)
04:49:03.765 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.765 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.765 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.765 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.765 STDOUT terraform:       + self                     = false
04:49:03.765 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.765 STDOUT terraform:       + to_port                  = 4443
04:49:03.766 STDOUT terraform:       + type                     = "ingress"
04:49:03.766 STDOUT terraform:     }
04:49:03.766 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
04:49:03.766 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
04:49:03.766 STDOUT terraform:       + description              = "Cluster API to node 6443/tcp webhook"
04:49:03.766 STDOUT terraform:       + from_port                = 6443
04:49:03.766 STDOUT terraform:       + id                       = (known after apply)
04:49:03.766 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.766 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.766 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.766 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.766 STDOUT terraform:       + self                     = false
04:49:03.766 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.766 STDOUT terraform:       + to_port                  = 6443
04:49:03.766 STDOUT terraform:       + type                     = "ingress"
04:49:03.766 STDOUT terraform:     }
04:49:03.766 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
04:49:03.766 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
04:49:03.766 STDOUT terraform:       + description              = "Cluster API to node 8443/tcp webhook"
04:49:03.766 STDOUT terraform:       + from_port                = 8443
04:49:03.766 STDOUT terraform:       + id                       = (known after apply)
04:49:03.766 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.766 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.766 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.766 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.766 STDOUT terraform:       + self                     = false
04:49:03.766 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.766 STDOUT terraform:       + to_port                  = 8443
04:49:03.766 STDOUT terraform:       + type                     = "ingress"
04:49:03.766 STDOUT terraform:     }
04:49:03.766 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
04:49:03.766 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
04:49:03.766 STDOUT terraform:       + description              = "Cluster API to node 9443/tcp webhook"
04:49:03.766 STDOUT terraform:       + from_port                = 9443
04:49:03.766 STDOUT terraform:       + id                       = (known after apply)
04:49:03.766 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.766 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.766 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.766 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.766 STDOUT terraform:       + self                     = false
04:49:03.767 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.767 STDOUT terraform:       + to_port                  = 9443
04:49:03.767 STDOUT terraform:       + type                     = "ingress"
04:49:03.767 STDOUT terraform:     }
04:49:03.767 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
04:49:03.767 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
04:49:03.767 STDOUT terraform:       + description              = "Cluster API to node kubelets"
04:49:03.767 STDOUT terraform:       + from_port                = 10250
04:49:03.767 STDOUT terraform:       + id                       = (known after apply)
04:49:03.767 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.767 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.767 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.767 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.767 STDOUT terraform:       + self                     = false
04:49:03.767 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.767 STDOUT terraform:       + to_port                  = 10250
04:49:03.767 STDOUT terraform:       + type                     = "ingress"
04:49:03.767 STDOUT terraform:     }
04:49:03.767 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
04:49:03.767 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
04:49:03.767 STDOUT terraform:       + description              = "Node to node ingress on ephemeral ports"
04:49:03.767 STDOUT terraform:       + from_port                = 1025
04:49:03.767 STDOUT terraform:       + id                       = (known after apply)
04:49:03.767 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.767 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.767 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.767 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.767 STDOUT terraform:       + self                     = true
04:49:03.767 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.767 STDOUT terraform:       + to_port                  = 65535
04:49:03.767 STDOUT terraform:       + type                     = "ingress"
04:49:03.767 STDOUT terraform:     }
04:49:03.767 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
04:49:03.767 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
04:49:03.767 STDOUT terraform:       + description              = "Node to node CoreDNS"
04:49:03.767 STDOUT terraform:       + from_port                = 53
04:49:03.767 STDOUT terraform:       + id                       = (known after apply)
04:49:03.767 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.767 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.767 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.767 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.767 STDOUT terraform:       + self                     = true
04:49:03.768 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.768 STDOUT terraform:       + to_port                  = 53
04:49:03.768 STDOUT terraform:       + type                     = "ingress"
04:49:03.768 STDOUT terraform:     }
04:49:03.768 STDOUT terraform:   # module.cluster.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
04:49:03.768 STDOUT terraform:   + resource "aws_security_group_rule" "node" {
04:49:03.768 STDOUT terraform:       + description              = "Node to node CoreDNS UDP"
04:49:03.768 STDOUT terraform:       + from_port                = 53
04:49:03.768 STDOUT terraform:       + id                       = (known after apply)
04:49:03.768 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.768 STDOUT terraform:       + protocol                 = "udp"
04:49:03.768 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.768 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.768 STDOUT terraform:       + self                     = true
04:49:03.768 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.768 STDOUT terraform:       + to_port                  = 53
04:49:03.768 STDOUT terraform:       + type                     = "ingress"
04:49:03.768 STDOUT terraform:     }
04:49:03.768 STDOUT terraform:   # module.cluster.time_sleep.this[0] will be created
04:49:03.768 STDOUT terraform:   + resource "time_sleep" "this" {
04:49:03.768 STDOUT terraform:       + create_duration = "30s"
04:49:03.768 STDOUT terraform:       + id              = (known after apply)
04:49:03.768 STDOUT terraform:       + triggers        = {
04:49:03.768 STDOUT terraform:           + "cluster_certificate_authority_data" = (known after apply)
04:49:03.768 STDOUT terraform:           + "cluster_endpoint"                   = (known after apply)
04:49:03.768 STDOUT terraform:           + "cluster_name"                       = (known after apply)
04:49:03.768 STDOUT terraform:           + "cluster_service_cidr"               = (known after apply)
04:49:03.768 STDOUT terraform:           + "cluster_version"                    = "1.31"
04:49:03.768 STDOUT terraform:         }
04:49:03.768 STDOUT terraform:     }
04:49:03.768 STDOUT terraform:   # module.eks_addons.aws_eks_addon.this[0] will be created
04:49:03.768 STDOUT terraform:   + resource "aws_eks_addon" "this" {
04:49:03.768 STDOUT terraform:       + addon_name                  = "amazon-cloudwatch-observability"
04:49:03.768 STDOUT terraform:       + addon_version               = (known after apply)
04:49:03.768 STDOUT terraform:       + arn                         = (known after apply)
04:49:03.768 STDOUT terraform:       + cluster_name                = "sbx-dev-eu-west-1-cluster-01-infra-01"
04:49:03.768 STDOUT terraform:       + configuration_values        = (known after apply)
04:49:03.768 STDOUT terraform:       + created_at                  = (known after apply)
04:49:03.768 STDOUT terraform:       + id                          = (known after apply)
04:49:03.768 STDOUT terraform:       + modified_at                 = (known after apply)
04:49:03.769 STDOUT terraform:       + resolve_conflicts_on_create = "OVERWRITE"
04:49:03.769 STDOUT terraform:       + tags                        = {
04:49:03.769 STDOUT terraform:           + "Environment" = "dev"
04:49:03.769 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.769 STDOUT terraform:         }
04:49:03.769 STDOUT terraform:       + tags_all                    = {
04:49:03.769 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.769 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.769 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.769 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.769 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.769 STDOUT terraform:         }
04:49:03.769 STDOUT terraform:     }
04:49:03.769 STDOUT terraform:   # module.eks_addons.aws_eks_addon.this[1] will be created
04:49:03.769 STDOUT terraform:   + resource "aws_eks_addon" "this" {
04:49:03.769 STDOUT terraform:       + addon_name                  = "eks-pod-identity-agent"
04:49:03.769 STDOUT terraform:       + addon_version               = (known after apply)
04:49:03.769 STDOUT terraform:       + arn                         = (known after apply)
04:49:03.769 STDOUT terraform:       + cluster_name                = "sbx-dev-eu-west-1-cluster-01-infra-01"
04:49:03.769 STDOUT terraform:       + configuration_values        = (known after apply)
04:49:03.769 STDOUT terraform:       + created_at                  = (known after apply)
04:49:03.769 STDOUT terraform:       + id                          = (known after apply)
04:49:03.769 STDOUT terraform:       + modified_at                 = (known after apply)
04:49:03.769 STDOUT terraform:       + resolve_conflicts_on_create = "OVERWRITE"
04:49:03.769 STDOUT terraform:       + tags                        = {
04:49:03.769 STDOUT terraform:           + "Environment" = "dev"
04:49:03.769 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.769 STDOUT terraform:         }
04:49:03.769 STDOUT terraform:       + tags_all                    = {
04:49:03.769 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.769 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.769 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.769 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.769 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.769 STDOUT terraform:         }
04:49:03.769 STDOUT terraform:     }
04:49:03.769 STDOUT terraform:   # module.ingress_alb_access_logs.aws_s3_bucket_notification.alb_access_logs_bucket will be created
04:49:03.769 STDOUT terraform:   + resource "aws_s3_bucket_notification" "alb_access_logs_bucket" {
04:49:03.769 STDOUT terraform:       + bucket      = (known after apply)
04:49:03.769 STDOUT terraform:       + eventbridge = true
04:49:03.769 STDOUT terraform:       + id          = (known after apply)
04:49:03.769 STDOUT terraform:     }
04:49:03.769 STDOUT terraform:   # module.ingress_alb_access_logs.aws_s3_bucket_policy.app_policy will be created
04:49:03.769 STDOUT terraform:   + resource "aws_s3_bucket_policy" "app_policy" {
04:49:03.769 STDOUT terraform:       + bucket = (known after apply)
04:49:03.769 STDOUT terraform:       + id     = (known after apply)
04:49:03.770 STDOUT terraform:       + policy = (known after apply)
04:49:03.770 STDOUT terraform:     }
04:49:03.770 STDOUT terraform:   # module.nodes["my-app-eks-x86"].data.aws_iam_policy_document.additional_policy will be read during apply
04:49:03.770 STDOUT terraform:   # (depends on a resource or a module with changes pending)
04:49:03.770 STDOUT terraform:  <= data "aws_iam_policy_document" "additional_policy" {
04:49:03.770 STDOUT terraform:       + id            = (known after apply)
04:49:03.770 STDOUT terraform:       + json          = (known after apply)
04:49:03.770 STDOUT terraform:       + minified_json = (known after apply)
04:49:03.770 STDOUT terraform:       + statement {
04:49:03.770 STDOUT terraform:           + actions   = [
04:49:03.770 STDOUT terraform:               + "ec2:*",
04:49:03.770 STDOUT terraform:               + "ecr:BatchCheckLayerAvailability",
04:49:03.770 STDOUT terraform:               + "ecr:BatchGetImage",
04:49:03.770 STDOUT terraform:               + "ecr:DescribeImageScanFindings",
04:49:03.770 STDOUT terraform:               + "ecr:DescribeImages",
04:49:03.770 STDOUT terraform:               + "ecr:DescribeRepositories",
04:49:03.770 STDOUT terraform:               + "ecr:GetAuthorizationToken",
04:49:03.770 STDOUT terraform:               + "ecr:GetDownloadUrlForLayer",
04:49:03.770 STDOUT terraform:               + "ecr:GetLifecyclePolicy",
04:49:03.770 STDOUT terraform:               + "ecr:GetLifecyclePolicyPreview",
04:49:03.770 STDOUT terraform:               + "ecr:GetRepositoryPolicy",
04:49:03.770 STDOUT terraform:               + "ecr:ListImages",
04:49:03.770 STDOUT terraform:               + "ecr:ListTagsForResource",
04:49:03.770 STDOUT terraform:               + "elasticfilesystem:*",
04:49:03.770 STDOUT terraform:               + "events:*",
04:49:03.770 STDOUT terraform:               + "iam:PassRole",
04:49:03.770 STDOUT terraform:               + "logs:*",
04:49:03.770 STDOUT terraform:             ]
04:49:03.770 STDOUT terraform:           + effect    = "Allow"
04:49:03.770 STDOUT terraform:           + resources = [
04:49:03.770 STDOUT terraform:               + "*",
04:49:03.770 STDOUT terraform:             ]
04:49:03.770 STDOUT terraform:         }
04:49:03.770 STDOUT terraform:     }
04:49:03.770 STDOUT terraform:   # module.nodes["my-app-eks-x86"].aws_autoscaling_policy.eks_autoscaling_policy[0] will be created
04:49:03.770 STDOUT terraform:   + resource "aws_autoscaling_policy" "eks_autoscaling_policy" {
04:49:03.770 STDOUT terraform:       + arn                     = (known after apply)
04:49:03.770 STDOUT terraform:       + autoscaling_group_name  = (known after apply)
04:49:03.770 STDOUT terraform:       + enabled                 = true
04:49:03.770 STDOUT terraform:       + id                      = (known after apply)
04:49:03.770 STDOUT terraform:       + metric_aggregation_type = (known after apply)
04:49:03.770 STDOUT terraform:       + name                    = (known after apply)
04:49:03.770 STDOUT terraform:       + policy_type             = "TargetTrackingScaling"
04:49:03.770 STDOUT terraform:       + target_tracking_configuration {
04:49:03.770 STDOUT terraform:           + disable_scale_in = false
04:49:03.770 STDOUT terraform:           + target_value     = 30
04:49:03.770 STDOUT terraform:           + predefined_metric_specification {
04:49:03.770 STDOUT terraform:               + predefined_metric_type = "ASGAverageCPUUtilization"
04:49:03.771 STDOUT terraform:             }
04:49:03.771 STDOUT terraform:         }
04:49:03.771 STDOUT terraform:     }
04:49:03.771 STDOUT terraform:   # module.nodes["my-app-eks-x86"].random_id.additional_id will be created
04:49:03.771 STDOUT terraform:   + resource "random_id" "additional_id" {
04:49:03.771 STDOUT terraform:       + b64_std     = (known after apply)
04:49:03.771 STDOUT terraform:       + b64_url     = (known after apply)
04:49:03.771 STDOUT terraform:       + byte_length = 8
04:49:03.771 STDOUT terraform:       + dec         = (known after apply)
04:49:03.771 STDOUT terraform:       + hex         = (known after apply)
04:49:03.771 STDOUT terraform:       + id          = (known after apply)
04:49:03.771 STDOUT terraform:     }
04:49:03.771 STDOUT terraform:   # module.cluster.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
04:49:03.771 STDOUT terraform:   # (config refers to values not yet known)
04:49:03.771 STDOUT terraform:  <= data "aws_iam_policy_document" "this" {
04:49:03.771 STDOUT terraform:       + id                        = (known after apply)
04:49:03.771 STDOUT terraform:       + json                      = (known after apply)
04:49:03.771 STDOUT terraform:       + minified_json             = (known after apply)
04:49:03.771 STDOUT terraform:       + override_policy_documents = []
04:49:03.771 STDOUT terraform:       + source_policy_documents   = []
04:49:03.771 STDOUT terraform:       + statement {
04:49:03.771 STDOUT terraform:           + actions   = [
04:49:03.771 STDOUT terraform:               + "kms:*",
04:49:03.771 STDOUT terraform:             ]
04:49:03.771 STDOUT terraform:           + resources = [
04:49:03.771 STDOUT terraform:               + "*",
04:49:03.771 STDOUT terraform:             ]
04:49:03.771 STDOUT terraform:           + sid       = "Default"
04:49:03.771 STDOUT terraform:           + principals {
04:49:03.771 STDOUT terraform:               + identifiers = [
04:49:03.771 STDOUT terraform:                   + "arn:aws:iam::955769636964:root",
04:49:03.771 STDOUT terraform:                 ]
04:49:03.771 STDOUT terraform:               + type        = "AWS"
04:49:03.771 STDOUT terraform:             }
04:49:03.771 STDOUT terraform:         }
04:49:03.771 STDOUT terraform:       + statement {
04:49:03.771 STDOUT terraform:           + actions   = [
04:49:03.771 STDOUT terraform:               + "kms:CancelKeyDeletion",
04:49:03.771 STDOUT terraform:               + "kms:Create*",
04:49:03.771 STDOUT terraform:               + "kms:Delete*",
04:49:03.771 STDOUT terraform:               + "kms:Describe*",
04:49:03.771 STDOUT terraform:               + "kms:Disable*",
04:49:03.771 STDOUT terraform:               + "kms:Enable*",
04:49:03.771 STDOUT terraform:               + "kms:Get*",
04:49:03.771 STDOUT terraform:               + "kms:ImportKeyMaterial",
04:49:03.771 STDOUT terraform:               + "kms:List*",
04:49:03.771 STDOUT terraform:               + "kms:Put*",
04:49:03.771 STDOUT terraform:               + "kms:ReplicateKey",
04:49:03.771 STDOUT terraform:               + "kms:Revoke*",
04:49:03.771 STDOUT terraform:               + "kms:ScheduleKeyDeletion",
04:49:03.771 STDOUT terraform:               + "kms:TagResource",
04:49:03.771 STDOUT terraform:               + "kms:UntagResource",
04:49:03.771 STDOUT terraform:               + "kms:Update*",
04:49:03.771 STDOUT terraform:             ]
04:49:03.771 STDOUT terraform:           + resources = [
04:49:03.771 STDOUT terraform:               + "*",
04:49:03.771 STDOUT terraform:             ]
04:49:03.771 STDOUT terraform:           + sid       = "KeyAdministration"
04:49:03.771 STDOUT terraform:           + principals {
04:49:03.771 STDOUT terraform:               + identifiers = [
04:49:03.771 STDOUT terraform:                   + "arn:aws:iam::955769636964:role/deployment-terragrunt-genopsx-eu-west-1-955769636964",
04:49:03.772 STDOUT terraform:                 ]
04:49:03.772 STDOUT terraform:               + type        = "AWS"
04:49:03.772 STDOUT terraform:             }
04:49:03.772 STDOUT terraform:         }
04:49:03.772 STDOUT terraform:       + statement {
04:49:03.772 STDOUT terraform:           + actions   = [
04:49:03.772 STDOUT terraform:               + "kms:Decrypt",
04:49:03.772 STDOUT terraform:               + "kms:DescribeKey",
04:49:03.772 STDOUT terraform:               + "kms:Encrypt",
04:49:03.772 STDOUT terraform:               + "kms:GenerateDataKey*",
04:49:03.772 STDOUT terraform:               + "kms:ReEncrypt*",
04:49:03.772 STDOUT terraform:             ]
04:49:03.772 STDOUT terraform:           + resources = [
04:49:03.772 STDOUT terraform:               + "*",
04:49:03.772 STDOUT terraform:             ]
04:49:03.772 STDOUT terraform:           + sid       = "KeyUsage"
04:49:03.772 STDOUT terraform:           + principals {
04:49:03.772 STDOUT terraform:               + identifiers = [
04:49:03.772 STDOUT terraform:                   + (known after apply),
04:49:03.772 STDOUT terraform:                 ]
04:49:03.772 STDOUT terraform:               + type        = "AWS"
04:49:03.772 STDOUT terraform:             }
04:49:03.772 STDOUT terraform:         }
04:49:03.772 STDOUT terraform:     }
04:49:03.772 STDOUT terraform:   # module.cluster.module.kms.aws_kms_alias.this["cluster"] will be created
04:49:03.772 STDOUT terraform:   + resource "aws_kms_alias" "this" {
04:49:03.772 STDOUT terraform:       + arn            = (known after apply)
04:49:03.772 STDOUT terraform:       + id             = (known after apply)
04:49:03.772 STDOUT terraform:       + name           = "alias/eks/sbx-dev-eu-west-1-cluster-01-infra-01"
04:49:03.772 STDOUT terraform:       + name_prefix    = (known after apply)
04:49:03.772 STDOUT terraform:       + target_key_arn = (known after apply)
04:49:03.772 STDOUT terraform:       + target_key_id  = (known after apply)
04:49:03.772 STDOUT terraform:     }
04:49:03.772 STDOUT terraform:   # module.cluster.module.kms.aws_kms_key.this[0] will be created
04:49:03.772 STDOUT terraform:   + resource "aws_kms_key" "this" {
04:49:03.772 STDOUT terraform:       + arn                                = (known after apply)
04:49:03.772 STDOUT terraform:       + bypass_policy_lockout_safety_check = false
04:49:03.772 STDOUT terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
04:49:03.772 STDOUT terraform:       + description                        = "sbx-dev-eu-west-1-cluster-01-infra-01 cluster encryption key"
04:49:03.772 STDOUT terraform:       + enable_key_rotation                = true
04:49:03.772 STDOUT terraform:       + id                                 = (known after apply)
04:49:03.772 STDOUT terraform:       + is_enabled                         = true
04:49:03.772 STDOUT terraform:       + key_id                             = (known after apply)
04:49:03.772 STDOUT terraform:       + key_usage                          = "ENCRYPT_DECRYPT"
04:49:03.772 STDOUT terraform:       + multi_region                       = false
04:49:03.772 STDOUT terraform:       + policy                             = (known after apply)
04:49:03.773 STDOUT terraform:       + rotation_period_in_days            = (known after apply)
04:49:03.773 STDOUT terraform:       + tags                               = {
04:49:03.773 STDOUT terraform:           + "Environment"           = "dev"
04:49:03.773 STDOUT terraform:           + "Terragrunt"            = "true"
04:49:03.773 STDOUT terraform:           + "terraform-aws-modules" = "eks"
04:49:03.773 STDOUT terraform:         }
04:49:03.773 STDOUT terraform:       + tags_all                           = {
04:49:03.773 STDOUT terraform:           + "Data-classification"   = "internal"
04:49:03.773 STDOUT terraform:           + "Environment"           = "dev"
04:49:03.773 STDOUT terraform:           + "Managed-by"            = "terragrunt"
04:49:03.773 STDOUT terraform:           + "Organization"          = "genopsx"
04:49:03.773 STDOUT terraform:           + "Terragrunt"            = "true"
04:49:03.773 STDOUT terraform:           + "terraform-aws-modules" = "eks"
04:49:03.773 STDOUT terraform:         }
04:49:03.773 STDOUT terraform:     }
04:49:03.773 STDOUT terraform:   # module.ebs_kms_key.module.ebs_kms_key.data.aws_iam_policy_document.this[0] will be read during apply
04:49:03.773 STDOUT terraform:   # (config refers to values not yet known)
04:49:03.773 STDOUT terraform:  <= data "aws_iam_policy_document" "this" {
04:49:03.773 STDOUT terraform:       + id                        = (known after apply)
04:49:03.773 STDOUT terraform:       + json                      = (known after apply)
04:49:03.773 STDOUT terraform:       + minified_json             = (known after apply)
04:49:03.773 STDOUT terraform:       + override_policy_documents = []
04:49:03.773 STDOUT terraform:       + source_policy_documents   = []
04:49:03.773 STDOUT terraform:       + statement {
04:49:03.773 STDOUT terraform:           + actions   = [
04:49:03.773 STDOUT terraform:               + "kms:*",
04:49:03.773 STDOUT terraform:             ]
04:49:03.773 STDOUT terraform:           + resources = [
04:49:03.773 STDOUT terraform:               + "*",
04:49:03.773 STDOUT terraform:             ]
04:49:03.773 STDOUT terraform:           + sid       = "Default"
04:49:03.773 STDOUT terraform:           + principals {
04:49:03.773 STDOUT terraform:               + identifiers = [
04:49:03.773 STDOUT terraform:                   + "arn:aws:iam::955769636964:root",
04:49:03.773 STDOUT terraform:                 ]
04:49:03.773 STDOUT terraform:               + type        = "AWS"
04:49:03.773 STDOUT terraform:             }
04:49:03.773 STDOUT terraform:         }
04:49:03.773 STDOUT terraform:       + statement {
04:49:03.773 STDOUT terraform:           + actions   = [
04:49:03.773 STDOUT terraform:               + "kms:CancelKeyDeletion",
04:49:03.773 STDOUT terraform:               + "kms:Create*",
04:49:03.773 STDOUT terraform:               + "kms:Delete*",
04:49:03.773 STDOUT terraform:               + "kms:Describe*",
04:49:03.773 STDOUT terraform:               + "kms:Disable*",
04:49:03.773 STDOUT terraform:               + "kms:Enable*",
04:49:03.773 STDOUT terraform:               + "kms:Get*",
04:49:03.773 STDOUT terraform:               + "kms:ImportKeyMaterial",
04:49:03.773 STDOUT terraform:               + "kms:List*",
04:49:03.773 STDOUT terraform:               + "kms:Put*",
04:49:03.773 STDOUT terraform:               + "kms:ReplicateKey",
04:49:03.773 STDOUT terraform:               + "kms:Revoke*",
04:49:03.773 STDOUT terraform:               + "kms:ScheduleKeyDeletion",
04:49:03.773 STDOUT terraform:               + "kms:TagResource",
04:49:03.773 STDOUT terraform:               + "kms:UntagResource",
04:49:03.773 STDOUT terraform:               + "kms:Update*",
04:49:03.773 STDOUT terraform:             ]
04:49:03.773 STDOUT terraform:           + resources = [
04:49:03.773 STDOUT terraform:               + "*",
04:49:03.774 STDOUT terraform:             ]
04:49:03.774 STDOUT terraform:           + sid       = "KeyAdministration"
04:49:03.774 STDOUT terraform:           + principals {
04:49:03.774 STDOUT terraform:               + identifiers = [
04:49:03.774 STDOUT terraform:                   + "arn:aws:sts::955769636964:assumed-role/deployment-terragrunt-genopsx-eu-west-1-955769636964/githubactionsession",
04:49:03.774 STDOUT terraform:                 ]
04:49:03.774 STDOUT terraform:               + type        = "AWS"
04:49:03.774 STDOUT terraform:             }
04:49:03.774 STDOUT terraform:         }
04:49:03.774 STDOUT terraform:       + statement {
04:49:03.774 STDOUT terraform:           + actions   = [
04:49:03.774 STDOUT terraform:               + "kms:Decrypt",
04:49:03.774 STDOUT terraform:               + "kms:DescribeKey",
04:49:03.774 STDOUT terraform:               + "kms:Encrypt",
04:49:03.774 STDOUT terraform:               + "kms:GenerateDataKey*",
04:49:03.774 STDOUT terraform:               + "kms:ReEncrypt*",
04:49:03.774 STDOUT terraform:             ]
04:49:03.774 STDOUT terraform:           + resources = [
04:49:03.774 STDOUT terraform:               + "*",
04:49:03.774 STDOUT terraform:             ]
04:49:03.774 STDOUT terraform:           + sid       = "KeyServiceRolesASG"
04:49:03.774 STDOUT terraform:           + principals {
04:49:03.774 STDOUT terraform:               + identifiers = [
04:49:03.774 STDOUT terraform:                   + "arn:aws:iam::955769636964:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling",
04:49:03.774 STDOUT terraform:                   + (known after apply),
04:49:03.774 STDOUT terraform:                 ]
04:49:03.774 STDOUT terraform:               + type        = "AWS"
04:49:03.774 STDOUT terraform:             }
04:49:03.774 STDOUT terraform:         }
04:49:03.774 STDOUT terraform:       + statement {
04:49:03.774 STDOUT terraform:           + actions   = [
04:49:03.774 STDOUT terraform:               + "kms:CreateGrant",
04:49:03.774 STDOUT terraform:             ]
04:49:03.774 STDOUT terraform:           + resources = [
04:49:03.774 STDOUT terraform:               + "*",
04:49:03.774 STDOUT terraform:             ]
04:49:03.774 STDOUT terraform:           + sid       = "KeyServiceRolesASGPersistentVol"
04:49:03.774 STDOUT terraform:           + condition {
04:49:03.774 STDOUT terraform:               + test     = "Bool"
04:49:03.774 STDOUT terraform:               + values   = [
04:49:03.774 STDOUT terraform:                   + "true",
04:49:03.774 STDOUT terraform:                 ]
04:49:03.774 STDOUT terraform:               + variable = "kms:GrantIsForAWSResource"
04:49:03.774 STDOUT terraform:             }
04:49:03.774 STDOUT terraform:           + principals {
04:49:03.774 STDOUT terraform:               + identifiers = [
04:49:03.774 STDOUT terraform:                   + "arn:aws:iam::955769636964:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling",
04:49:03.774 STDOUT terraform:                   + (known after apply),
04:49:03.774 STDOUT terraform:                 ]
04:49:03.774 STDOUT terraform:               + type        = "AWS"
04:49:03.774 STDOUT terraform:             }
04:49:03.774 STDOUT terraform:         }
04:49:03.774 STDOUT terraform:     }
04:49:03.774 STDOUT terraform:   # module.ebs_kms_key.module.ebs_kms_key.aws_kms_alias.this["kms/sbx-dev-eu-west-1-cluster-01-infra-01/ebs"] will be created
04:49:03.775 STDOUT terraform:   + resource "aws_kms_alias" "this" {
04:49:03.775 STDOUT terraform:       + arn            = (known after apply)
04:49:03.775 STDOUT terraform:       + id             = (known after apply)
04:49:03.775 STDOUT terraform:       + name           = "alias/kms/sbx-dev-eu-west-1-cluster-01-infra-01/ebs"
04:49:03.775 STDOUT terraform:       + name_prefix    = (known after apply)
04:49:03.775 STDOUT terraform:       + target_key_arn = (known after apply)
04:49:03.775 STDOUT terraform:       + target_key_id  = (known after apply)
04:49:03.775 STDOUT terraform:     }
04:49:03.775 STDOUT terraform:   # module.ebs_kms_key.module.ebs_kms_key.aws_kms_key.this[0] will be created
04:49:03.775 STDOUT terraform:   + resource "aws_kms_key" "this" {
04:49:03.775 STDOUT terraform:       + arn                                = (known after apply)
04:49:03.775 STDOUT terraform:       + bypass_policy_lockout_safety_check = false
04:49:03.775 STDOUT terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
04:49:03.775 STDOUT terraform:       + description                        = "Customer managed key to encrypt EKS managed node group volumes"
04:49:03.775 STDOUT terraform:       + enable_key_rotation                = true
04:49:03.775 STDOUT terraform:       + id                                 = (known after apply)
04:49:03.775 STDOUT terraform:       + is_enabled                         = true
04:49:03.775 STDOUT terraform:       + key_id                             = (known after apply)
04:49:03.775 STDOUT terraform:       + key_usage                          = "ENCRYPT_DECRYPT"
04:49:03.775 STDOUT terraform:       + multi_region                       = false
04:49:03.775 STDOUT terraform:       + policy                             = (known after apply)
04:49:03.775 STDOUT terraform:       + rotation_period_in_days            = (known after apply)
04:49:03.775 STDOUT terraform:       + tags                               = {
04:49:03.775 STDOUT terraform:           + "Environment" = "dev"
04:49:03.775 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.775 STDOUT terraform:         }
04:49:03.775 STDOUT terraform:       + tags_all                           = {
04:49:03.775 STDOUT terraform:           + "Data-classificati
04:49:03.775 STDOUT terraform: on" = "internal"
04:49:03.775 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.775 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.775 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.775 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.775 STDOUT terraform:         }
04:49:03.775 STDOUT terraform:     }
04:49:03.775 STDOUT terraform:   # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_eks_fargate_profile.this[0] will be created
04:49:03.776 STDOUT terraform:   + resource "aws_eks_fargate_profile" "this" {
04:49:03.776 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.776 STDOUT terraform:       + cluster_name           = "sbx-dev-eu-west-1-cluster-01-infra-01"
04:49:03.776 STDOUT terraform:       + fargate_profile_name   = "demo"
04:49:03.776 STDOUT terraform:       + id                     = (known after apply)
04:49:03.776 STDOUT terraform:       + pod_execution_role_arn = (known after apply)
04:49:03.776 STDOUT terraform:       + status                 = (known after apply)
04:49:03.776 STDOUT terraform:       + subnet_ids             = [
04:49:03.776 STDOUT terraform:           + "subnet-4",
04:49:03.776 STDOUT terraform:           + "subnet-5",
04:49:03.776 STDOUT terraform:           + "subnet-6",
04:49:03.776 STDOUT terraform:         ]
04:49:03.776 STDOUT terraform:       + tags                   = {
04:49:03.776 STDOUT terraform:           + "Environment" = "dev"
04:49:03.776 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.776 STDOUT terraform:         }
04:49:03.776 STDOUT terraform:       + tags_all               = {
04:49:03.776 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.776 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.776 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.776 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.776 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.776 STDOUT terraform:         }
04:49:03.776 STDOUT terraform:       + selector {
04:49:03.776 STDOUT terraform:           + namespace = "demo"
04:49:03.776 STDOUT terraform:         }
04:49:03.776 STDOUT terraform:       + timeouts {
04:49:03.776 STDOUT terraform:           + create = "5m"
04:49:03.776 STDOUT terraform:         }
04:49:03.776 STDOUT terraform:     }
04:49:03.776 STDOUT terraform:   # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_iam_role.this[0] will be created
04:49:03.776 STDOUT terraform:   + resource "aws_iam_role" "this" {
04:49:03.776 STDOUT terraform:       + arn                   = (known after apply)
04:49:03.776 STDOUT terraform:       + assume_role_policy    = jsonencode(
04:49:03.776 STDOUT terraform:             {
04:49:03.776 STDOUT terraform:               + Statement = [
04:49:03.776 STDOUT terraform:                   + {
04:49:03.776 STDOUT terraform:                       + Action    = "sts:AssumeRole"
04:49:03.776 STDOUT terraform:                       + Condition = {
04:49:03.776 STDOUT terraform:                           + ArnLike = {
04:49:03.776 STDOUT terraform:                               + "aws:SourceArn" = "arn:aws:eks:eu-west-1:955769636964:fargateprofile/sbx-dev-eu-west-1-cluster-01-infra-01/*"
04:49:03.776 STDOUT terraform:                             }
04:49:03.776 STDOUT terraform:                         }
04:49:03.776 STDOUT terraform:                       + Effect    = "Allow"
04:49:03.776 STDOUT terraform:                       + Principal = {
04:49:03.776 STDOUT terraform:                           + Service = "eks-fargate-pods.amazonaws.com"
04:49:03.776 STDOUT terraform:                         }
04:49:03.776 STDOUT terraform:                     },
04:49:03.776 STDOUT terraform:                 ]
04:49:03.776 STDOUT terraform:               + Version   = "2012-10-17"
04:49:03.777 STDOUT terraform:             }
04:49:03.777 STDOUT terraform:         )
04:49:03.777 STDOUT terraform:       + create_date           = (known after apply)
04:49:03.777 STDOUT terraform:       + force_detach_policies = true
04:49:03.777 STDOUT terraform:       + id                    = (known after apply)
04:49:03.777 STDOUT terraform:       + managed_policy_arns   = (known after apply)
04:49:03.777 STDOUT terraform:       + max_session_duration  = 3600
04:49:03.777 STDOUT terraform:       + name                  = "sbx-dev-eu-west-1-cluster-01-infra-01-fargate-role"
04:49:03.777 STDOUT terraform:       + name_prefix           = (known after apply)
04:49:03.777 STDOUT terraform:       + path                  = "/"
04:49:03.777 STDOUT terraform:       + tags                  = {
04:49:03.777 STDOUT terraform:           + "Environment" = "dev"
04:49:03.777 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.777 STDOUT terraform:         }
04:49:03.777 STDOUT terraform:       + tags_all              = {
04:49:03.777 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.777 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.777 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.777 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.777 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.777 STDOUT terraform:         }
04:49:03.777 STDOUT terraform:       + unique_id             = (known after apply)
04:49:03.777 STDOUT terraform:       + inline_policy (known after apply)
04:49:03.777 STDOUT terraform:     }
04:49:03.777 STDOUT terraform:   # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_iam_role_policy_attachment.additional["AmazonEKSFargatePodExecutionRolePolicy"] will be created
04:49:03.777 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
04:49:03.777 STDOUT terraform:       + id         = (known after apply)
04:49:03.777 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
04:49:03.777 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-fargate-role"
04:49:03.777 STDOUT terraform:     }
04:49:03.777 STDOUT terraform:   # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_iam_role_policy_attachment.this["AmazonEKSFargatePodExecutionRolePolicy"] will be created
04:49:03.777 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
04:49:03.777 STDOUT terraform:       + id         = (known after apply)
04:49:03.777 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
04:49:03.778 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-fargate-role"
04:49:03.778 STDOUT terraform:     }
04:49:03.778 STDOUT terraform:   # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
04:49:03.778 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
04:49:03.778 STDOUT terraform:       + id         = (known after apply)
04:49:03.778 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
04:49:03.778 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-fargate-role"
04:49:03.778 STDOUT terraform:     }
04:49:03.778 STDOUT terraform:   # module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket.this[0] will be created
04:49:03.778 STDOUT terraform:   + resource "aws_s3_bucket" "this" {
04:49:03.778 STDOUT terraform:       + acceleration_status         = (known after apply)
04:49:03.778 STDOUT terraform:       + acl                         = (known after apply)
04:49:03.778 STDOUT terraform:       + arn                         = (known after apply)
04:49:03.778 STDOUT terraform:       + bucket                      = "sbx-dev-eu-west-1-ingress-alb-access-logs"
04:49:03.778 STDOUT terraform:       + bucket_domain_name          = (known after apply)
04:49:03.778 STDOUT terraform:       + bucket_prefix               = (known after apply)
04:49:03.778 STDOUT terraform:       + bucket_regional_domain_name = (known after apply)
04:49:03.778 STDOUT terraform:       + force_destroy               = false
04:49:03.778 STDOUT terraform:       + hosted_zone_id              = (known after apply)
04:49:03.779 STDOUT terraform:       + id                          = (known after apply)
04:49:03.779 STDOUT terraform:       + object_lock_enabled         = false
04:49:03.779 STDOUT terraform:       + policy                      = (known after apply)
04:49:03.779 STDOUT terraform:       + region                      = (known after apply)
04:49:03.779 STDOUT terraform:       + request_payer               = (known after apply)
04:49:03.779 STDOUT terraform:       + tags_all                    = {
04:49:03.779 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.779 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.779 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.779 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.779 STDOUT terraform:         }
04:49:03.779 STDOUT terraform:       + website_domain              = (known after apply)
04:49:03.779 STDOUT terraform:       + website_endpoint            = (known after apply)
04:49:03.779 STDOUT terraform:       + cors_rule (known after apply)
04:49:03.779 STDOUT terraform:       + grant (known after apply)
04:49:03.779 STDOUT terraform:       + lifecycle_rule (known after apply)
04:49:03.779 STDOUT terraform:       + logging (known after apply)
04:49:03.779 STDOUT terraform:       + object_lock_configuration (known after apply)
04:49:03.779 STDOUT terraform:       + replication_configuration (known after apply)
04:49:03.779 STDOUT terraform:       + server_side_encryption_configuration (known after apply)
04:49:03.779 STDOUT terraform:       + versioning (known after apply)
04:49:03.779 STDOUT terraform:       + website (known after apply)
04:49:03.779 STDOUT terraform:     }
04:49:03.779 STDOUT terraform:   # module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket_acl.this[0] will be created
04:49:03.780 STDOUT terraform:   + resource "aws_s3_bucket_acl" "this" {
04:49:03.780 STDOUT terraform:       + acl    = "private"
04:49:03.780 STDOUT terraform:       + bucket = (known after apply)
04:49:03.780 STDOUT terraform:       + id     = (known after apply)
04:49:03.780 STDOUT terraform:       + access_control_policy (known after apply)
04:49:03.780 STDOUT terraform:     }
04:49:03.780 STDOUT terraform:   # module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket_ownership_controls.this[0] will be created
04:49:03.780 STDOUT terraform:   + resource "aws_s3_bucket_ownership_controls" "this" {
04:49:03.780 STDOUT terraform:       + bucket = (known after apply)
04:49:03.780 STDOUT terraform:       + id     = (known after apply)
04:49:03.780 STDOUT terraform:       + rule {
04:49:03.780 STDOUT terraform:           + object_ownership = "ObjectWriter"
04:49:03.780 STDOUT terraform:         }
04:49:03.780 STDOUT terraform:     }
04:49:03.780 STDOUT terraform:   # module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket_public_access_block.this[0] will be created
04:49:03.780 STDOUT terraform:   + resource "aws_s3_bucket_public_access_block" "this" {
04:49:03.780 STDOUT terraform:       + block_public_acls       = true
04:49:03.780 STDOUT terraform:       + block_public_policy     = true
04:49:03.780 STDOUT terraform:       + bucket                  = (known after apply)
04:49:03.780 STDOUT terraform:       + id                      = (known after apply)
04:49:03.780 STDOUT terraform:       + ignore_public_acls      = true
04:49:03.780 STDOUT terraform:       + restrict_public_buckets = true
04:49:03.780 STDOUT terraform:     }
04:49:03.780 STDOUT terraform:   # module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
04:49:03.780 STDOUT terraform:   + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
04:49:03.780 STDOUT terraform:       + bucket = (known after apply)
04:49:03.780 STDOUT terraform:       + id     = (known after apply)
04:49:03.780 STDOUT terraform:       + rule {
04:49:03.780 STDOUT terraform:           + apply_server_side_encryption_by_default {
04:49:03.781 STDOUT terraform:               + sse_algorithm     = "AES256"
04:49:03.781 STDOUT terraform:                 # (1 unchanged attribute hidden)
04:49:03.781 STDOUT terraform:             }
04:49:03.781 STDOUT terraform:         }
04:49:03.781 STDOUT terraform:     }
04:49:03.781 STDOUT terraform:   # module.ingress_alb_access_logs.module.alb_access_logs.aws_s3_bucket_versioning.this[0] will be created
04:49:03.781 STDOUT terraform:   + resource "aws_s3_bucket_versioning" "this" {
04:49:03.781 STDOUT terraform:       + bucket = (known after apply)
04:49:03.781 STDOUT terraform:       + id     = (known after apply)
04:49:03.781 STDOUT terraform:       + versioning_configuration {
04:49:03.781 STDOUT terraform:           + mfa_delete = (known after apply)
04:49:03.781 STDOUT terraform:           + status     = "Enabled"
04:49:03.781 STDOUT terraform:         }
04:49:03.781 STDOUT terraform:     }
04:49:03.781 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["airflow"].aws_s3_object.this[0] will be created
04:49:03.781 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.781 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.781 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.781 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.781 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.781 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.781 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.781 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.781 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.781 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.781 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.781 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.781 STDOUT terraform:       + force_destroy          = false
04:49:03.781 STDOUT terraform:       + id                     = (known after apply)
04:49:03.781 STDOUT terraform:       + key                    = "airflow/.logskeeper"
04:49:03.781 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.781 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.781 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.781 STDOUT terraform:       + tags_all               = {
04:49:03.781 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.781 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.781 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.781 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.781 STDOUT terraform:         }
04:49:03.781 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.781 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.781 STDOUT terraform:     }
04:49:03.781 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["alertmanager"].aws_s3_object.this[0] will be created
04:49:03.782 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.782 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.782 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.782 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.782 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.782 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.782 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.782 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.782 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.782 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.782 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.782 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.782 STDOUT terraform:       + force_destroy          = false
04:49:03.782 STDOUT terraform:       + id                     = (known after apply)
04:49:03.782 STDOUT terraform:       + key                    = "alertmanager/.logskeeper"
04:49:03.782 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.782 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.782 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.782 STDOUT terraform:       + tags_all               = {
04:49:03.782 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.782 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.782 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.782 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.782 STDOUT terraform:         }
04:49:03.782 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.782 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.782 STDOUT terraform:     }
04:49:03.782 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["argo"].aws_s3_object.this[0] will be created
04:49:03.782 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.782 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.782 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.782 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.782 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.782 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.782 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.782 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.782 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.782 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.782 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.782 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.782 STDOUT terraform:       + force_destroy          = false
04:49:03.783 STDOUT terraform:       + id                     = (known after apply)
04:49:03.783 STDOUT terraform:       + key                    = "argo/.logskeeper"
04:49:03.783 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.783 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.783 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.783 STDOUT terraform:       + tags_all               = {
04:49:03.783 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.783 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.783 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.783 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.783 STDOUT terraform:         }
04:49:03.783 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.783 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.783 STDOUT terraform:     }
04:49:03.783 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["argo-events"].aws_s3_object.this[0] will be created
04:49:03.783 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.783 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.783 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.783 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.783 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.783 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.783 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.783 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.783 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.783 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.783 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.783 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.783 STDOUT terraform:       + force_destroy          = false
04:49:03.783 STDOUT terraform:       + id                     = (known after apply)
04:49:03.783 STDOUT terraform:       + key                    = "argo-events/.logskeeper"
04:49:03.783 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.783 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.783 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.783 STDOUT terraform:       + tags_all               = {
04:49:03.783 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.783 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.783 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.783 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.783 STDOUT terraform:         }
04:49:03.783 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.783 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.783 STDOUT terraform:     }
04:49:03.783 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["argo-rollouts"].aws_s3_object.this[0] will be created
04:49:03.784 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.784 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.784 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.784 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.784 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.784 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.784 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.784 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.784 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.784 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.784 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.784 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.784 STDOUT terraform:       + force_destroy          = false
04:49:03.784 STDOUT terraform:       + id                     = (known after apply)
04:49:03.784 STDOUT terraform:       + key                    = "argo-rollouts/.logskeeper"
04:49:03.784 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.784 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.784 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.784 STDOUT terraform:       + tags_all               = {
04:49:03.784 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.784 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.784 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.784 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.784 STDOUT terraform:         }
04:49:03.784 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.784 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.784 STDOUT terraform:     }
04:49:03.784 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["argo-rollouts-demo"].aws_s3_object.this[0] will be created
04:49:03.784 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.784 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.784 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.784 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.784 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.784 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.784 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.784 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.784 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.784 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.785 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.785 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.785 STDOUT terraform:       + force_destroy          = false
04:49:03.785 STDOUT terraform:       + id                     = (known after apply)
04:49:03.785 STDOUT terraform:       + key                    = "argo-rollouts-demo/.logskeeper"
04:49:03.785 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.785 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.785 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.785 STDOUT terraform:       + tags_all               = {
04:49:03.785 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.785 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.785 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.785 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.785 STDOUT terraform:         }
04:49:03.785 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.785 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.785 STDOUT terraform:     }
04:49:03.785 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["argo-workflows"].aws_s3_object.this[0] will be created
04:49:03.785 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.785 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.785 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.785 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.785 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.785 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.785 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.785 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.785 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.785 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.785 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.785 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.785 STDOUT terraform:       + force_destroy          = false
04:49:03.785 STDOUT terraform:       + id                     = (known after apply)
04:49:03.785 STDOUT terraform:       + key                    = "argo-workflows/.logskeeper"
04:49:03.785 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.785 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.785 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.785 STDOUT terraform:       + tags_all               = {
04:49:03.785 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.785 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.785 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.785 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.786 STDOUT terraform:         }
04:49:03.786 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.786 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.786 STDOUT terraform:     }
04:49:03.786 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["argocd"].aws_s3_object.this[0] will be created
04:49:03.786 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.786 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.786 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.786 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.786 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.786 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.786 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.786 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.786 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.786 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.786 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.786 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.786 STDOUT terraform:       + force_destroy          = false
04:49:03.786 STDOUT terraform:       + id                     = (known after apply)
04:49:03.786 STDOUT terraform:       + key                    = "argocd/.logskeeper"
04:49:03.786 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.786 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.786 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.786 STDOUT terraform:       + tags_all               = {
04:49:03.786 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.786 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.786 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.786 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.786 STDOUT terraform:         }
04:49:03.786 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.786 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.786 STDOUT terraform:     }
04:49:03.786 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["elasticsearch"].aws_s3_object.this[0] will be created
04:49:03.786 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.786 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.786 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.786 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.786 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.786 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.787 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.787 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.787 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.787 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.787 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.787 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.787 STDOUT terraform:       + force_destroy          = false
04:49:03.787 STDOUT terraform:       + id                     = (known after apply)
04:49:03.787 STDOUT terraform:       + key                    = "elasticsearch/.logskeeper"
04:49:03.787 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.787 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.787 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.787 STDOUT terraform:       + tags_all               = {
04:49:03.787 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.787 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.787 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.787 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.787 STDOUT terraform:         }
04:49:03.787 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.787 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.787 STDOUT terraform:     }
04:49:03.787 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["goldilocks"].aws_s3_object.this[0] will be created
04:49:03.787 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.787 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.787 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.787 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.787 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.787 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.787 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.787 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.787 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.787 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.787 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.787 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.787 STDOUT terraform:       + force_destroy          = false
04:49:03.787 STDOUT terraform:       + id                     = (known after apply)
04:49:03.787 STDOUT terraform:       + key                    = "goldilocks/.logskeeper"
04:49:03.787 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.787 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.787 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.788 STDOUT terraform:       + tags_all               = {
04:49:03.788 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.788 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.788 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.788 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.788 STDOUT terraform:         }
04:49:03.788 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.788 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.788 STDOUT terraform:     }
04:49:03.788 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["grafana"].aws_s3_object.this[0] will be created
04:49:03.788 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.788 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.788 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.788 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.788 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.788 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.788 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.788 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.788 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.788 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.788 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.788 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.788 STDOUT terraform:       + force_destroy          = false
04:49:03.788 STDOUT terraform:       + id                     = (known after apply)
04:49:03.788 STDOUT terraform:       + key                    = "grafana/.logskeeper"
04:49:03.788 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.788 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.788 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.788 STDOUT terraform:       + tags_all               = {
04:49:03.788 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.788 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.788 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.788 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.788 STDOUT terraform:         }
04:49:03.788 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.788 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.788 STDOUT terraform:     }
04:49:03.788 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["jaeger"].aws_s3_object.this[0] will be created
04:49:03.788 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.788 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.788 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.788 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.789 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.789 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.789 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.789 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.789 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.789 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.789 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.789 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.789 STDOUT terraform:       + force_destroy          = false
04:49:03.789 STDOUT terraform:       + id                     = (known after apply)
04:49:03.789 STDOUT terraform:       + key                    = "jaeger/.logskeeper"
04:49:03.789 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.789 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.789 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.789 STDOUT terraform:       + tags_all               = {
04:49:03.789 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.789 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.789 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.789 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.789 STDOUT terraform:         }
04:49:03.789 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.789 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.789 STDOUT terraform:     }
04:49:03.789 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["jaeger_demo"].aws_s3_object.this[0] will be created
04:49:03.789 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.789 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.789 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.789 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.789 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.789 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.789 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.789 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.789 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.789 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.789 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.789 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.789 STDOUT terraform:       + force_destroy          = false
04:49:03.789 STDOUT terraform:       + id                     = (known after apply)
04:49:03.789 STDOUT terraform:       + key                    = "jaeger-demo/.logskeeper"
04:49:03.789 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.789 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.789 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.790 STDOUT terraform:       + tags_all               = {
04:49:03.790 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.790 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.790 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.790 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.790 STDOUT terraform:         }
04:49:03.790 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.790 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.790 STDOUT terraform:     }
04:49:03.790 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["jenkins"].aws_s3_object.this[0] will be created
04:49:03.790 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.790 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.790 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.790 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.790 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.790 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.790 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.790 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.790 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.790 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.790 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.790 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.790 STDOUT terraform:       + force_destroy          = false
04:49:03.790 STDOUT terraform:       + id                     = (known after apply)
04:49:03.790 STDOUT terraform:       + key                    = "jenkins/.logskeeper"
04:49:03.790 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.790 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.790 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.790 STDOUT terraform:       + tags_all               = {
04:49:03.790 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.790 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.790 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.790 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.790 STDOUT terraform:         }
04:49:03.790 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.790 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.790 STDOUT terraform:     }
04:49:03.790 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["kibana"].aws_s3_object.this[0] will be created
04:49:03.790 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.790 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.790 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.791 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.791 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.791 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.791 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.791 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.791 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.791 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.791 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.791 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.791 STDOUT terraform:       + force_destroy          = false
04:49:03.791 STDOUT terraform:       + id                     = (known after apply)
04:49:03.791 STDOUT terraform:       + key                    = "kibana/.logskeeper"
04:49:03.791 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.791 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.791 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.791 STDOUT terraform:       + tags_all               = {
04:49:03.791 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.791 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.791 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.791 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.791 STDOUT terraform:         }
04:49:03.791 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.791 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.791 STDOUT terraform:     }
04:49:03.791 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["kubeshark"].aws_s3_object.this[0] will be created
04:49:03.791 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.791 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.791 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.791 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.791 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.791 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.791 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.791 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.791 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.791 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.791 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.791 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.791 STDOUT terraform:       + force_destroy          = false
04:49:03.791 STDOUT terraform:       + id                     = (known after apply)
04:49:03.791 STDOUT terraform:       + key                    = "kubeshark/.logskeeper"
04:49:03.791 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.791 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.792 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.792 STDOUT terraform:       + tags_all               = {
04:49:03.792 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.792 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.792 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.792 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.792 STDOUT terraform:         }
04:49:03.792 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.792 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.792 STDOUT terraform:     }
04:49:03.792 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["loki-stack"].aws_s3_object.this[0] will be created
04:49:03.792 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.792 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.792 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.792 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.792 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.792 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.792 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.792 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.792 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.792 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.792 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.792 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.792 STDOUT terraform:       + force_destroy          = false
04:49:03.792 STDOUT terraform:       + id                     = (known after apply)
04:49:03.792 STDOUT terraform:       + key                    = "loki-stack/.logskeeper"
04:49:03.792 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.792 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.792 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.792 STDOUT terraform:       + tags_all               = {
04:49:03.792 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.792 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.792 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.792 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.792 STDOUT terraform:         }
04:49:03.792 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.792 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.792 STDOUT terraform:     }
04:49:03.792 STDOUT terraform:   # module.ingress_alb_access_logs.module.s3_bucket_objects["prometheus"].aws_s3_object.this[0] will be created
04:49:03.792 STDOUT terraform:   + resource "aws_s3_object" "this" {
04:49:03.792 STDOUT terraform:       + acl                    = "bucket-owner-full-control"
04:49:03.793 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.793 STDOUT terraform:       + bucket                 = (known after apply)
04:49:03.793 STDOUT terraform:       + bucket_key_enabled     = (known after apply)
04:49:03.793 STDOUT terraform:       + checksum_crc32         = (known after apply)
04:49:03.793 STDOUT terraform:       + checksum_crc32c        = (known after apply)
04:49:03.793 STDOUT terraform:       + checksum_crc64nvme     = (known after apply)
04:49:03.793 STDOUT terraform:       + checksum_sha1          = (known after apply)
04:49:03.793 STDOUT terraform:       + checksum_sha256        = (known after apply)
04:49:03.793 STDOUT terraform:       + content_type           = "text/plain"
04:49:03.793 STDOUT terraform:       + etag                   = (known after apply)
04:49:03.793 STDOUT terraform:       + force_destroy          = false
04:49:03.793 STDOUT terraform:       + id                     = (known after apply)
04:49:03.793 STDOUT terraform:       + key                    = "prometheus/.logskeeper"
04:49:03.793 STDOUT terraform:       + kms_key_id             = (known after apply)
04:49:03.793 STDOUT terraform:       + server_side_encryption = (known after apply)
04:49:03.793 STDOUT terraform:       + storage_class          = (known after apply)
04:49:03.793 STDOUT terraform:       + tags_all               = {
04:49:03.793 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.793 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.793 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.793 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.793 STDOUT terraform:         }
04:49:03.793 STDOUT terraform:       + version_id             = (known after apply)
04:49:03.793 STDOUT terraform:         # (1 unchanged attribute hidden)
04:49:03.793 STDOUT terraform:     }
04:49:03.793 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.additional_policy.aws_iam_policy.polic
04:49:03.793 STDOUT terraform: y[0] will be created
04:49:03.793 STDOUT terraform:   + resource "aws_iam_policy" "policy" {
04:49:03.793 STDOUT terraform:       + arn              = (known after apply)
04:49:03.793 STDOUT terraform:       + attachment_count = (known after apply)
04:49:03.793 STDOUT terraform:       + description      = "Additional policy for eks node group"
04:49:03.793 STDOUT terraform:       + id               = (known after apply)
04:49:03.793 STDOUT terraform:       + name             = (known after apply)
04:49:03.793 STDOUT terraform:       + name_prefix      = (known after apply)
04:49:03.793 STDOUT terraform:       + path             = "/"
04:49:03.793 STDOUT terraform:       + policy           = (known after apply)
04:49:03.793 STDOUT terraform:       + policy_id        = (known after apply)
04:49:03.793 STDOUT terraform:       + tags             = {
04:49:03.793 STDOUT terraform:           + "PolicyDescription" = "Policy created using example from data source"
04:49:03.793 STDOUT terraform:         }
04:49:03.793 STDOUT terraform:       + tags_all         = {
04:49:03.793 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.793 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.793 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.793 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.794 STDOUT terraform:           + "PolicyDescription"   = "Policy created using example from data source"
04:49:03.794 STDOUT terraform:         }
04:49:03.794 STDOUT terraform:     }
04:49:03.794 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.data.aws_caller_identity.current will be read during apply
04:49:03.794 STDOUT terraform:   # (depends on a resource or a module with changes pending)
04:49:03.794 STDOUT terraform:  <= data "aws_caller_identity" "current" {
04:49:03.794 STDOUT terraform:       + account_id = (known after apply)
04:49:03.794 STDOUT terraform:       + arn        = (known after apply)
04:49:03.794 STDOUT terraform:       + id         = (known after apply)
04:49:03.794 STDOUT terraform:       + user_id    = (known after apply)
04:49:03.794 STDOUT terraform:     }
04:49:03.794 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.data.aws_iam_policy_document.assume_role_policy[0] will be read during apply
04:49:03.794 STDOUT terraform:   # (depends on a resource or a module with changes pending)
04:49:03.794 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy" {
04:49:03.794 STDOUT terraform:       + id            = (known after apply)
04:49:03.794 STDOUT terraform:       + json          = (known after apply)
04:49:03.794 STDOUT terraform:       + minified_json = (known after apply)
04:49:03.794 STDOUT terraform:       + statement {
04:49:03.794 STDOUT terraform:           + actions = [
04:49:03.794 STDOUT terraform:               + "sts:AssumeRole",
04:49:03.794 STDOUT terraform:             ]
04:49:03.794 STDOUT terraform:           + sid     = "EKSNodeAssumeRole"
04:49:03.794 STDOUT terraform:           + principals {
04:49:03.794 STDOUT terraform:               + identifiers = [
04:49:03.794 STDOUT terraform:                   + "ec2.amazonaws.com",
04:49:03.794 STDOUT terraform:                 ]
04:49:03.794 STDOUT terraform:               + type        = "Service"
04:49:03.794 STDOUT terraform:             }
04:49:03.794 STDOUT terraform:         }
04:49:03.794 STDOUT terraform:     }
04:49:03.794 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.data.aws_partition.current will be read during apply
04:49:03.794 STDOUT terraform:   # (depends on a resource or a module with changes pending)
04:49:03.794 STDOUT terraform:  <= data "aws_partition" "current" {
04:49:03.794 STDOUT terraform:       + dns_suffix         = (known after apply)
04:49:03.794 STDOUT terraform:       + id                 = (known after apply)
04:49:03.794 STDOUT terraform:       + partition          = (known after apply)
04:49:03.794 STDOUT terraform:       + reverse_dns_prefix = (known after apply)
04:49:03.794 STDOUT terraform:     }
04:49:03.794 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_eks_node_group.this[0] will be created
04:49:03.794 STDOUT terraform:   + resource "aws_eks_node_group" "this" {
04:49:03.794 STDOUT terraform:       + ami_type               = "AL2_x86_64"
04:49:03.795 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.795 STDOUT terraform:       + capacity_type          = "ON_DEMAND"
04:49:03.795 STDOUT terraform:       + cluster_name           = "sbx-dev-eu-west-1-cluster-01-infra-01"
04:49:03.795 STDOUT terraform:       + disk_size              = (known after apply)
04:49:03.795 STDOUT terraform:       + id                     = (known after apply)
04:49:03.795 STDOUT terraform:       + instance_types         = [
04:49:03.795 STDOUT terraform:           + "m7i.4xlarge",
04:49:03.795 STDOUT terraform:         ]
04:49:03.795 STDOUT terraform:       + node_group_name        = (known after apply)
04:49:03.795 STDOUT terraform:       + node_group_name_prefix = "my-app-eks-x86-"
04:49:03.795 STDOUT terraform:       + node_role_arn          = (known after apply)
04:49:03.795 STDOUT terraform:       + release_version        = (known after apply)
04:49:03.795 STDOUT terraform:       + resources              = (known after apply)
04:49:03.795 STDOUT terraform:       + status                 = (known after apply)
04:49:03.795 STDOUT terraform:       + subnet_ids             = [
04:49:03.795 STDOUT terraform:           + "subnet-1",
04:49:03.795 STDOUT terraform:           + "subnet-2",
04:49:03.795 STDOUT terraform:           + "subnet-3",
04:49:03.795 STDOUT terraform:         ]
04:49:03.795 STDOUT terraform:       + tags                   = {
04:49:03.795 STDOUT terraform:           + "Environment" = "dev"
04:49:03.795 STDOUT terraform:           + "Name"        = "my-app-eks-x86"
04:49:03.795 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.795 STDOUT terraform:         }
04:49:03.795 STDOUT terraform:       + tags_all               = {
04:49:03.795 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.795 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.795 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.795 STDOUT terraform:           + "Name"                = "my-app-eks-x86"
04:49:03.795 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.795 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.795 STDOUT terraform:         }
04:49:03.795 STDOUT terraform:       + version                = "1.31"
04:49:03.795 STDOUT terraform:       + launch_template {
04:49:03.795 STDOUT terraform:           + id      = (known after apply)
04:49:03.795 STDOUT terraform:           + name    = (known after apply)
04:49:03.795 STDOUT terraform:           + version = (known after apply)
04:49:03.795 STDOUT terraform:         }
04:49:03.795 STDOUT terraform:       + node_repair_config (known after apply)
04:49:03.795 STDOUT terraform:       + scaling_config {
04:49:03.795 STDOUT terraform:           + desired_size = 3
04:49:03.795 STDOUT terraform:           + max_size     = 16
04:49:03.795 STDOUT terraform:           + min_size     = 3
04:49:03.795 STDOUT terraform:         }
04:49:03.795 STDOUT terraform:       + timeouts {}
04:49:03.795 STDOUT terraform:       + update_config {
04:49:03.795 STDOUT terraform:           + max_unavailable_percentage = 33
04:49:03.795 STDOUT terraform:         }
04:49:03.795 STDOUT terraform:     }
04:49:03.795 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role.this[0] will be created
04:49:03.795 STDOUT terraform:   + resource "aws_iam_role" "this" {
04:49:03.795 STDOUT terraform:       + arn                   = (known after apply)
04:49:03.795 STDOUT terraform:       + assume_role_policy    = (known after apply)
04:49:03.795 STDOUT terraform:       + create_date           = (known after apply)
04:49:03.795 STDOUT terraform:       + force_detach_policies = true
04:49:03.796 STDOUT terraform:       + id                    = (known after apply)
04:49:03.796 STDOUT terraform:       + managed_policy_arns   = (known after apply)
04:49:03.796 STDOUT terraform:       + max_session_duration  = 3600
04:49:03.796 STDOUT terraform:       + name                  = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.796 STDOUT terraform:       + name_prefix           = (known after apply)
04:49:03.796 STDOUT terraform:       + path                  = "/"
04:49:03.796 STDOUT terraform:       + tags                  = {
04:49:03.796 STDOUT terraform:           + "Environment" = "dev"
04:49:03.796 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.796 STDOUT terraform:         }
04:49:03.796 STDOUT terraform:       + tags_all              = {
04:49:03.796 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.796 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.796 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.796 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.796 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.796 STDOUT terraform:         }
04:49:03.796 STDOUT terraform:       + unique_id             = (known after apply)
04:49:03.796 STDOUT terraform:       + inline_policy (known after apply)
04:49:03.796 STDOUT terraform:     }
04:49:03.796 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["AmazonEC2ContainerServiceforEC2Role"] will be created
04:49:03.796 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
04:49:03.796 STDOUT terraform:       + id         = (known after apply)
04:49:03.796 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
04:49:03.796 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.796 STDOUT terraform:     }
04:49:03.796 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["CloudWatchFullAccess"] will be created
04:49:03.796 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
04:49:03.796 STDOUT terraform:       + id         = (known after apply)
04:49:03.796 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/CloudWatchFullAccess"
04:49:03.796 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.796 STDOUT terraform:     }
04:49:03.797 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["CloudWatchLogsFullAccess"] will be created
04:49:03.797 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
04:49:03.797 STDOUT terraform:       + id         = (known after apply)
04:49:03.797 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"
04:49:03.797 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.797 STDOUT terraform:     }
04:49:03.797 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["additional_policy"] will be created
04:49:03.797 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
04:49:03.797 STDOUT terraform:       + id         = (known after apply)
04:49:03.797 STDOUT terraform:       + policy_arn = (known after apply)
04:49:03.797 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.797 STDOUT terraform:     }
04:49:03.797 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["cloudwatch_agent_policy"] will be created
04:49:03.797 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
04:49:03.797 STDOUT terraform:       + id         = (known after apply)
04:49:03.797 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
04:49:03.797 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.797 STDOUT terraform:     }
04:49:03.797 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["cni_policy"] will be created
04:49:03.797 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
04:49:03.797 STDOUT terraform:       + id         = (known after apply)
04:49:03.797 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
04:49:03.798 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.798 STDOUT terraform:     }
04:49:03.798 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["ssm_managed_instance_core_policy"] will be created
04:49:03.798 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
04:49:03.798 STDOUT terraform:       + id         = (known after apply)
04:49:03.798 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
04:49:03.798 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.798 STDOUT terraform:     }
04:49:03.798 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["vpc_resource_controller_policy"] will be created
04:49:03.798 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
04:49:03.798 STDOUT terraform:       + id         = (known after apply)
04:49:03.798 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
04:49:03.798 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.798 STDOUT terraform:     }
04:49:03.798 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["worker_node_policy"] will be created
04:49:03.798 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "additional" {
04:49:03.798 STDOUT terraform:       + id         = (known after apply)
04:49:03.798 STDOUT terraform:       + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
04:49:03.798 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.798 STDOUT terraform:     }
04:49:03.798 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
04:49:03.798 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
04:49:03.798 STDOUT terraform:       + id         = (known after apply)
04:49:03.799 STDOUT terraform:       + policy_arn = (known after apply)
04:49:03.799 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.799 STDOUT terraform:     }
04:49:03.799 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
04:49:03.799 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
04:49:03.799 STDOUT terraform:       + id         = (known after apply)
04:49:03.799 STDOUT terraform:       + policy_arn = (known after apply)
04:49:03.799 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.799 STDOUT terraform:     }
04:49:03.799 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
04:49:03.799 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "this" {
04:49:03.799 STDOUT terraform:       + id         = (known after apply)
04:49:03.799 STDOUT terraform:       + policy_arn = (known after apply)
04:49:03.799 STDOUT terraform:       + role       = "sbx-dev-eu-west-1-cluster-01-infra-01-node-group-role"
04:49:03.799 STDOUT terraform:     }
04:49:03.799 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_launch_template.this[0] will be created
04:49:03.799 STDOUT terraform:   + resource "aws_launch_template" "this" {
04:49:03.799 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.799 STDOUT terraform:       + default_version        = (known after apply)
04:49:03.799 STDOUT terraform:       + id                     = (known after apply)
04:49:03.799 STDOUT terraform:       + latest_version         = (known after apply)
04:49:03.799 STDOUT terraform:       + name                   = (known after apply)
04:49:03.799 STDOUT terraform:       + name_prefix            = "my-app-eks-x86-eks-node-group-"
04:49:03.799 STDOUT terraform:       + tags                   = {
04:49:03.799 STDOUT terraform:           + "Environment" = "dev"
04:49:03.799 STDOUT terraform:           + "Terragrunt"  = "true"
04:49:03.799 STDOUT terraform:         }
04:49:03.799 STDOUT terraform:       + tags_all               = {
04:49:03.799 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.799 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.799 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.799 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.799 STDOUT terraform:           + "Terragrunt"          = "true"
04:49:03.799 STDOUT terraform:         }
04:49:03.799 STDOUT terraform:       + update_default_version = true
04:49:03.799 STDOUT terraform:         # (2 unchanged attributes hidden)
04:49:03.799 STDOUT terraform:       + block_device_mappings {
04:49:03.800 STDOUT terraform:           + device_name = "/dev/xvda"
04:49:03.800 STDOUT terraform:           + ebs (known after apply)
04:49:03.800 STDOUT terraform:         }
04:49:03.800 STDOUT terraform:       + metadata_options {
04:49:03.800 STDOUT terraform:           + http_endpoint               = "enabled"
04:49:03.800 STDOUT terraform:           + http_protocol_ipv6          = (known after apply)
04:49:03.800 STDOUT terraform:           + http_put_response_hop_limit = 2
04:49:03.800 STDOUT terraform:           + http_tokens                 = "required"
04:49:03.800 STDOUT terraform:           + instance_metadata_tags      = "enabled"
04:49:03.800 STDOUT terraform:         }
04:49:03.800 STDOUT terraform:       + monitoring {
04:49:03.800 STDOUT terraform:           + enabled = true
04:49:03.800 STDOUT terraform:         }
04:49:03.800 STDOUT terraform:       + network_interfaces {
04:49:03.800 STDOUT terraform:           + associate_public_ip_address = "true"
04:49:03.800 STDOUT terraform:           + delete_on_termination       = "true"
04:49:03.800 STDOUT terraform:           + security_groups             = (known after apply)
04:49:03.800 STDOUT terraform:         }
04:49:03.800 STDOUT terraform:       + tag_specifications {
04:49:03.800 STDOUT terraform:           + resource_type = "instance"
04:49:03.800 STDOUT terraform:           + tags          = {
04:49:03.800 STDOUT terraform:               + "Environment" = "dev"
04:49:03.800 STDOUT terraform:               + "Name"        = "my-app-eks-x86"
04:49:03.800 STDOUT terraform:               + "Terragrunt"  = "true"
04:49:03.800 STDOUT terraform:             }
04:49:03.800 STDOUT terraform:         }
04:49:03.800 STDOUT terraform:       + tag_specifications {
04:49:03.800 STDOUT terraform:           + resource_type = "network-interface"
04:49:03.800 STDOUT terraform:           + tags          = {
04:49:03.800 STDOUT terraform:               + "Environment" = "dev"
04:49:03.800 STDOUT terraform:               + "Name"        = "my-app-eks-x86"
04:49:03.800 STDOUT terraform:               + "Terragrunt"  = "true"
04:49:03.800 STDOUT terraform:             }
04:49:03.800 STDOUT terraform:         }
04:49:03.800 STDOUT terraform:       + tag_specifications {
04:49:03.800 STDOUT terraform:           + resource_type = "volume"
04:49:03.800 STDOUT terraform:           + tags          = {
04:49:03.800 STDOUT terraform:               + "Environment" = "dev"
04:49:03.800 STDOUT terraform:               + "Name"        = "my-app-eks-x86"
04:49:03.800 STDOUT terraform:               + "Terragrunt"  = "true"
04:49:03.800 STDOUT terraform:             }
04:49:03.800 STDOUT terraform:         }
04:49:03.800 STDOUT terraform:     }
04:49:03.800 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group.this_name_prefix[0] will be created
04:49:03.800 STDOUT terraform:   + resource "aws_security_group" "this_name_prefix" {
04:49:03.800 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.800 STDOUT terraform:       + description            = "Security group for ALB ingress"
04:49:03.800 STDOUT terraform:       + egress                 = (known after apply)
04:49:03.800 STDOUT terraform:       + id                     = (known after apply)
04:49:03.800 STDOUT terraform:       + ingress                = (known after apply)
04:49:03.800 STDOUT terraform:       + name                   = (known after apply)
04:49:03.800 STDOUT terraform:       + name_prefix            = "sbx-dev-eu-west-1-extra-alb-ingress-sg-955769636964-"
04:49:03.800 STDOUT terraform:       + owner_id               = (known after apply)
04:49:03.801 STDOUT terraform:       + revoke_rules_on_delete = false
04:49:03.801 STDOUT terraform:       + tags                   = {
04:49:03.801 STDOUT terraform:           + "Name"         = "sbx-dev-eu-west-1-extra-alb-ingress-sg-955769636964"
04:49:03.801 STDOUT terraform:           + "worker-nodes" = "worker-nodes"
04:49:03.801 STDOUT terraform:         }
04:49:03.801 STDOUT terraform:       + tags_all               = {
04:49:03.801 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.801 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.801 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.801 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-extra-alb-ingress-sg-955769636964"
04:49:03.801 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.801 STDOUT terraform:           + "worker-nodes"        = "worker-nodes"
04:49:03.801 STDOUT terraform:         }
04:49:03.801 STDOUT terraform:       + vpc_id                 = "vpc-1234"
04:49:03.801 STDOUT terraform:       + timeouts {
04:49:03.801 STDOUT terraform:           + create = "15m"
04:49:03.801 STDOUT terraform:           + delete = "45m"
04:49:03.801 STDOUT terraform:         }
04:49:03.801 STDOUT terraform:     }
04:49:03.801 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
04:49:03.801 STDOUT terraform:   + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
04:49:03.801 STDOUT terraform:       + cidr_blocks              = [
04:49:03.801 STDOUT terraform:           + "0.0.0.0/0",
04:49:03.801 STDOUT terraform:         ]
04:49:03.801 STDOUT terraform:       + description              = "Allow all outgoing connections to everywhere"
04:49:03.801 STDOUT terraform:       + from_port                = 0
04:49:03.801 STDOUT terraform:       + id                       = (known after apply)
04:49:03.801 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.801 STDOUT terraform:       + protocol                 = "-1"
04:49:03.801 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.801 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.801 STDOUT terraform:       + self                     = false
04:49:03.801 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.801 STDOUT terraform:       + to_port                  = 0
04:49:03.801 STDOUT terraform:       + type                     = "egress"
04:49:03.801 STDOUT terraform:     }
04:49:03.801 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0] will be created
04:49:03.801 STDOUT terraform:   + resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
04:49:03.801 STDOUT terraform:       + description              = "Service ports (ipv6)"
04:49:03.801 STDOUT terraform:       + from_port                = 0
04:49:03.801 STDOUT terraform:       + id                       = (known after apply)
04:49:03.802 STDOUT terraform:       + ipv6_cidr_blocks         = [
04:49:03.802 STDOUT terraform:           + "::/0",
04:49:03.802 STDOUT terraform:         ]
04:49:03.802 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.802 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.802 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.802 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.802 STDOUT terraform:       + self                     = false
04:49:03.802 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.802 STDOUT terraform:       + to_port                  = 0
04:49:03.802 STDOUT terraform:       + type                     = "egress"
04:49:03.802 STDOUT terraform:     }
04:49:03.802 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
04:49:03.802 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
04:49:03.802 STDOUT terraform:       + cidr_blocks              = [
04:49:03.802 STDOUT terraform:           + "0.0.0.0/0",
04:49:03.802 STDOUT terraform:         ]
04:49:03.802 STDOUT terraform:       + description              = "Allow HTTP traffic"
04:49:03.802 STDOUT terraform:       + from_port                = 80
04:49:03.802 STDOUT terraform:       + id                       = (known after apply)
04:49:03.802 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.802 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.802 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.802 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.802 STDOUT terraform:       + self                     = false
04:49:03.802 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.802 STDOUT terraform:       + to_port                  = 80
04:49:03.802 STDOUT terraform:       + type                     = "ingress"
04:49:03.802 STDOUT terraform:     }
04:49:03.802 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
04:49:03.802 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
04:49:03.802 STDOUT terraform:       + cidr_blocks              = [
04:49:03.802 STDOUT terraform:           + "0.0.0.0/0",
04:49:03.802 STDOUT terraform:         ]
04:49:03.802 STDOUT terraform:       + description              = "Allow SSH traffic"
04:49:03.802 STDOUT terraform:       + from_port                = 22
04:49:03.802 STDOUT terraform:       + id                       = (known after apply)
04:49:03.802 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.802 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.802 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.802 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.802 STDOUT terraform:       + self                     = false
04:49:03.802 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.802 STDOUT terraform:       + to_port                  = 22
04:49:03.802 STDOUT terraform:       + type                     = "ingress"
04:49:03.802 STDOUT terraform:     }
04:49:03.803 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[2] will be created
04:49:03.803 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
04:49:03.803 STDOUT terraform:       + cidr_blocks              = [
04:49:03.803 STDOUT terraform:           + "0.0.0.0/0",
04:49:03.803 STDOUT terraform:         ]
04:49:03.803 STDOUT terraform:       + description              = "Allow HTTPS traffic"
04:49:03.803 STDOUT terraform:       + from_port                = 443
04:49:03.803 STDOUT terraform:       + id                       = (known after apply)
04:49:03.803 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.803 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.803 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.803 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.803 STDOUT terraform:       + self                     = false
04:49:03.803 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.803 STDOUT terraform:       + to_port                  = 443
04:49:03.803 STDOUT terraform:       + type                     = "ingress"
04:49:03.803 STDOUT terraform:     }
04:49:03.803 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[3] will be created
04:49:03.803 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
04:49:03.803 STDOUT terraform:       + cidr_blocks              = [
04:49:03.803 STDOUT terraform:           + "0.0.0.0/0",
04:49:03.803 STDOUT terraform:         ]
04:49:03.803 STDOUT terraform:       + description              = "Allow 8443 HTTPS traffic"
04:49:03.803 STDOUT terraform:       + from_port                = 8443
04:49:03.803 STDOUT terraform:       + id                       = (known after apply)
04:49:03.803 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.803 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.803 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.803 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.803 STDOUT terraform:       + self                     = false
04:49:03.803 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.803 STDOUT terraform:       + to_port                  = 8443
04:49:03.803 STDOUT terraform:       + type                     = "ingress"
04:49:03.803 STDOUT terraform:     }
04:49:03.803 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[4] will be created
04:49:03.803 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
04:49:03.803 STDOUT terraform:       + cidr_blocks              = [
04:49:03.803 STDOUT terraform:           + "0.0.0.0/0",
04:49:03.803 STDOUT terraform:         ]
04:49:03.803 STDOUT terraform:       + description              = "Allow 8080 HTTP traffic"
04:49:03.804 STDOUT terraform:       + from_port                = 8080
04:49:03.804 STDOUT terraform:       + id                       = (known after apply)
04:49:03.804 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.804 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.804 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.804 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.804 STDOUT terraform:       + self                     = false
04:49:03.804 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.804 STDOUT terraform:       + to_port                  = 8080
04:49:03.804 STDOUT terraform:       + type                     = "ingress"
04:49:03.804 STDOUT terraform:     }
04:49:03.804 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0] will be created
04:49:03.804 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
04:49:03.804 STDOUT terraform:       + description              = "Service ports (ipv6)"
04:49:03.804 STDOUT terraform:       + from_port                = 80
04:49:03.804 STDOUT terraform:       + id                       = (known after apply)
04:49:03.804 STDOUT terraform:       + ipv6_cidr_blocks         = [
04:49:03.804 STDOUT terraform:           + "::/0",
04:49:03.804 STDOUT terraform:         ]
04:49:03.804 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.804 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.804 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.804 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.804 STDOUT terraform:       + self                     = false
04:49:03.804 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.804 STDOUT terraform:       + to_port                  = 80
04:49:03.804 STDOUT terraform:       + type                     = "ingress"
04:49:03.804 STDOUT terraform:     }
04:49:03.804 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[1] will be created
04:49:03.804 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
04:49:03.804 STDOUT terraform:       + description              = "Service ports (ipv6)"
04:49:03.804 STDOUT terraform:       + from_port                = 443
04:49:03.804 STDOUT terraform:       + id                       = (known after apply)
04:49:03.804 STDOUT terraform:       + ipv6_cidr_blocks         = [
04:49:03.804 STDOUT terraform:           + "::/0",
04:49:03.804 STDOUT terraform:         ]
04:49:03.804 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.804 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.804 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.804 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.804 STDOUT terraform:       + self                     = false
04:49:03.804 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.804 STDOUT terraform:       + to_port                  = 443
04:49:03.805 STDOUT terraform:       + type                     = "ingress"
04:49:03.805 STDOUT terraform:     }
04:49:03.805 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[2] will be created
04:49:03.805 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
04:49:03.805 STDOUT terraform:       + description              = "Service ports (ipv6)"
04:49:03.805 STDOUT terraform:       + from_port                = 8443
04:49:03.805 STDOUT terraform:       + id                       = (known after apply)
04:49:03.805 STDOUT terraform:       + ipv6_cidr_blocks         = [
04:49:03.805 STDOUT terraform:           + "::/0",
04:49:03.805 STDOUT terraform:         ]
04:49:03.805 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.805 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.805 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.805 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.805 STDOUT terraform:       + self                     = false
04:49:03.805 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.805 STDOUT terraform:       + to_port                  = 8443
04:49:03.805 STDOUT terraform:       + type                     = "ingress"
04:49:03.805 STDOUT terraform:     }
04:49:03.805 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[3] will be created
04:49:03.805 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
04:49:03.805 STDOUT terraform:       + description              = "Service ports (ipv6)"
04:49:03.805 STDOUT terraform:       + from_port                = 8080
04:49:03.805 STDOUT terraform:       + id                       = (known after apply)
04:49:03.805 STDOUT terraform:       + ipv6_cidr_blocks         = [
04:49:03.805 STDOUT terraform:           + "::/0",
04:49:03.805 STDOUT terraform:         ]
04:49:03.805 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.805 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.805 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.805 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.805 STDOUT terraform:       + self                     = false
04:49:03.805 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.805 STDOUT terraform:       + to_port                  = 8080
04:49:03.805 STDOUT terraform:       + type                     = "ingress"
04:49:03.805 STDOUT terraform:     }
04:49:03.805 STDOUT terraform:   # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_self[0] will be created
04:49:03.805 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_self" {
04:49:03.805 STDOUT terraform:       + description              = "Allow all incoming connections from this security group"
04:49:03.806 STDOUT terraform:       + from_port                = -1
04:49:03.806 STDOUT terraform:       + id                       = (known after apply)
04:49:03.806 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.806 STDOUT terraform:       + protocol                 = "0"
04:49:03.806 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.806 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.806 STDOUT terraform:       + self                     = true
04:49:03.806 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.806 STDOUT terraform:       + to_port                  = 0
04:49:03.806 STDOUT terraform:       + type                     = "ingress"
04:49:03.806 STDOUT terraform:     }
04:49:03.806 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group.this_name_prefix[0] will be created
04:49:03.806 STDOUT terraform:   + resource "aws_security_group" "this_name_prefix" {
04:49:03.806 STDOUT terraform:       + arn                    = (known after apply)
04:49:03.806 STDOUT terraform:       + description            = "Security group for nodes"
04:49:03.806 STDOUT terraform:       + egress                 = (known after apply)
04:49:03.806 STDOUT terraform:       + id                     = (known after apply)
04:49:03.806 STDOUT terraform:       + ingress                = (known after apply)
04:49:03.806 STDOUT terraform:       + name                   = (known after apply)
04:49:03.806 STDOUT terraform:       + name_prefix            = "sbx-dev-eu-west-1-extra-node-sg-955769636964-"
04:49:03.806 STDOUT terraform:       + owner_id               = (known after apply)
04:49:03.806 STDOUT terraform:       + revoke_rules_on_delete = false
04:49:03.806 STDOUT terraform:       + tags                   = {
04:49:03.806 STDOUT terraform:           + "Name"         = "sbx-dev-eu-west-1-extra-node-sg-955769636964"
04:49:03.806 STDOUT terraform:           + "worker-nodes" = "worker-nodes"
04:49:03.806 STDOUT terraform:         }
04:49:03.806 STDOUT terraform:       + tags_all               = {
04:49:03.806 STDOUT terraform:           + "Data-classification" = "internal"
04:49:03.806 STDOUT terraform:           + "Environment"         = "dev"
04:49:03.806 STDOUT terraform:           + "Managed-by"          = "terragrunt"
04:49:03.806 STDOUT terraform:           + "Name"                = "sbx-dev-eu-west-1-extra-node-sg-955769636964"
04:49:03.806 STDOUT terraform:           + "Organization"        = "genopsx"
04:49:03.806 STDOUT terraform:           + "worker-nodes"        = "worker-nodes"
04:49:03.806 STDOUT terraform:         }
04:49:03.806 STDOUT terraform:       + vpc_id                 = "vpc-1234"
04:49:03.806 STDOUT terraform:       + timeouts {
04:49:03.806 STDOUT terraform:           + create = "15m"
04:49:03.806 STDOUT terraform:           + delete = "45m"
04:49:03.806 STDOUT terraform:         }
04:49:03.806 STDOUT terraform:     }
04:49:03.806 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
04:49:03.806 STDOUT terraform:   + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
04:49:03.807 STDOUT terraform:       + cidr_blocks              = [
04:49:03.807 STDOUT terraform:           + "0.0.0.0/0",
04:49:03.807 STDOUT terraform:         ]
04:49:03.807 STDOUT terraform:       + description              = "Allow all outgoing connections to everywhere"
04:49:03.807 STDOUT terraform:       + from_port                = 0
04:49:03.807 STDOUT terraform:       + id                       = (known after apply)
04:49:03.807 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.807 STDOUT terraform:       + protocol                 = "-1"
04:49:03.807 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.807 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.807 STDOUT terraform:       + self                     = false
04:49:03.807 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.807 STDOUT terraform:       + to_port                  = 0
04:49:03.807 STDOUT terraform:       + type                     = "egress"
04:49:03.807 STDOUT terraform:     }
04:49:03.807 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0] will be created
04:49:03.807 STDOUT terraform:   + resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
04:49:03.808 STDOUT terraform:       + description              = "Service ports (ipv6)"
04:49:03.808 STDOUT terraform:       + from_port                = 0
04:49:03.808 STDOUT terraform:       + id                       = (known after apply)
04:49:03.808 STDOUT terraform:       + ipv6_cidr_blocks         = [
04:49:03.808 STDOUT terraform:           + "::/0",
04:49:03.808 STDOUT terraform:         ]
04:49:03.808 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.808 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.808 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.808 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.808 STDOUT terraform:       + self                     = false
04:49:03.808 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.808 STDOUT terraform:       + to_port                  = 0
04:49:03.808 STDOUT terraform:       + type                     = "egress"
04:49:03.808 STDOUT terraform:     }
04:49:03.808 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
04:49:03.808 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
04:49:03.808 STDOUT terraform:       + cidr_blocks              = [
04:49:03.808 STDOUT terraform:           + "0.0.0.0/0",
04:49:03.808 STDOUT terraform:         ]
04:49:03.808 STDOUT terraform:       + description              = "Allow HTTPS traffic from EKS to EKS (internal calls)"
04:49:03.808 STDOUT terraform:       + from_port                = 443
04:49:03.809 STDOUT terraform:       + id                       = (known after apply)
04:49:03.809 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.809 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.809 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.809 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.809 STDOUT terraform:       + self                     = false
04:49:03.809 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.809 STDOUT terraform:       + to_port                  = 443
04:49:03.809 STDOUT terraform:       + type                     = "ingress"
04:49:03.809 STDOUT terraform:     }
04:49:03.809 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0] will be created
04:49:03.809 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
04:49:03.809 STDOUT terraform:       + description              = "Service ports (ipv6)"
04:49:03.809 STDOUT terraform:       + from_port                = 443
04:49:03.809 STDOUT terraform:       + id                       = (known after apply)
04:49:03.809 STDOUT terraform:       + ipv6_cidr_blocks         = [
04:49:03.809 STDOUT terraform:           + "::/0",
04:49:03.809 STDOUT terraform:         ]
04:49:03.809 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.809 STDOUT terraform:       + protocol                 = "tcp"
04:49:03.809 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.809 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.809 STDOUT terraform:       + self                     = false
04:49:03.810 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.810 STDOUT terraform:       + to_port                  = 443
04:49:03.810 STDOUT terraform:       + type                     = "ingress"
04:49:03.810 STDOUT terraform:     }
04:49:03.810 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group_rule.ingress_with_self[0] will be created
04:49:03.810 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_self" {
04:49:03.810 STDOUT terraform:       + description              = "Allow all incoming connections from this security group"
04:49:03.810 STDOUT terraform:       + from_port                = -1
04:49:03.810 STDOUT terraform:       + id                       = (known after apply)
04:49:03.810 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.810 STDOUT terraform:       + protocol                 = "0"
04:49:03.810 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.810 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.810 STDOUT terraform:       + self                     = true
04:49:03.810 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.810 STDOUT terraform:       + to_port                  = 0
04:49:03.810 STDOUT terraform:       + type                     = "ingress"
04:49:03.811 STDOUT terraform:     }
04:49:03.811 STDOUT terraform:   # module.security_node.module.security_group.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
04:49:03.811 STDOUT terraform:   + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
04:49:03.811 STDOUT terraform:       + description              = "Allow all incoming connections from ALB security group"
04:49:03.811 STDOUT terraform:       + from_port                = 0
04:49:03.811 STDOUT terraform:       + id                       = (known after apply)
04:49:03.811 STDOUT terraform:       + prefix_list_ids          = []
04:49:03.811 STDOUT terraform:       + protocol                 = "-1"
04:49:03.811 STDOUT terraform:       + security_group_id        = (known after apply)
04:49:03.811 STDOUT terraform:       + security_group_rule_id   = (known after apply)
04:49:03.811 STDOUT terraform:       + self                     = false
04:49:03.811 STDOUT terraform:       + source_security_group_id = (known after apply)
04:49:03.811 STDOUT terraform:       + to_port                  = 0
04:49:03.811 STDOUT terraform:       + type                     = "ingress"
04:49:03.811 STDOUT terraform:     }
04:49:03.811 STDOUT terraform:   # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.module.user_data.null_resource.validate_cluster_service_cidr will be created
04:49:03.811 STDOUT terraform:   + resource "null_resource" "validate_cluster_service_cidr" {
04:49:03.811 STDOUT terraform:       + id = (known after apply)
04:49:03.811 STDOUT terraform:     }
04:49:03.811 STDOUT terraform: Plan: 116 to add, 0 to change, 0 to destroy.
04:49:03.811 STDOUT terraform: Changes to Outputs:
04:49:03.811 STDOUT terraform:   + acm_certificate_arn                           = (known after apply)
04:49:03.811 STDOUT terraform:   + cloudwatch_log_group_arn                      = (known after apply)
04:49:03.811 STDOUT terraform:   + cloudwatch_log_group_name                     = "/aws/eks/sbx-dev-eu-west-1-cluster-01-infra-01/cluster"
04:49:03.811 STDOUT terraform:   + clsuter_iam_role_name                         = "sbx-dev-eu-west-1-cluster-01-infra-01-cluster"
04:49:03.811 STDOUT terraform:   + cluster_arn                                   = (known after apply)
04:49:03.811 STDOUT terraform:   + cluster_certificate_authority_data            = (known after apply)
04:49:03.812 STDOUT terraform:   + cluster_endpoint                              = (known after apply)
04:49:03.812 STDOUT terraform:   + cluster_iam_role_arn                          = (known after apply)
04:49:03.812 STDOUT terraform:   + cluster_id                                    = (known after apply)
04:49:03.812 STDOUT terraform:   + cluster_identity_providers                    = {}
04:49:03.812 STDOUT terraform:   + cluster_ip_family                             = "ipv4"
04:49:03.812 STDOUT terraform:   + cluster_name                                  = "sbx-dev-eu-west-1-cluster-01-infra-01"
04:49:03.812 STDOUT terraform:   + cluster_oidc_issuer_url                       = (known after apply)
04:49:03.812 STDOUT terraform:   + cluster_oidc_provider                         = (known after apply)
04:49:03.812 STDOUT terraform:   + cluster_oidc_provider_arn                     = (known after apply)
04:49:03.812 STDOUT terraform:   + cluster_platform_version                      = (known after apply)
04:49:03.812 STDOUT terraform:   + cluster_primary_security_group_id             = (known after apply)
04:49:03.812 STDOUT terraform:   + cluster_region                                = "eu-west-1"
04:49:03.812 STDOUT terraform:   + cluster_service_cidr                          = (known after apply)
04:49:03.812 STDOUT terraform:   + cluster_status                                = (known after apply)
04:49:03.812 STDOUT terraform:   + cluster_token                                 = (sensitive value)
04:49:03.812 STDOUT terraform:   + cluster_version                               = "1.31"
04:49:03.812 STDOUT terraform:   + combined_primary_and_nodes_security_group_ids = [
04:49:03.812 STDOUT terraform:       + (known after apply),
04:49:03.812 STDOUT terraform:       + (known after apply),
04:49:03.812 STDOUT terraform:     ]
04:49:03.812 STDOUT terraform:   + ingress_alb_access_logs_bucket_arn            = (known after apply)
04:49:03.812 STDOUT terraform:   + ingress_alb_access_logs_bucket_id             = (known after apply)
04:49:03.812 STDOUT terraform:   + ingress_alb_access_logs_bucket_paths          = {
04:49:03.812 STDOUT terraform:       + airflow            = "airflow"
04:49:03.812 STDOUT terraform:       + alertmanager       = "alertmanager"
04:49:03.812 STDOUT terraform:       + argo               = "argo"
04:49:03.812 STDOUT terraform:       + argo-events        = "argo-events"
04:49:03.812 STDOUT terraform:       + argo-rollouts      = "argo-rollouts"
04:49:03.812 STDOUT terraform:       + argo-rollouts-demo = "argo-rollouts-demo"
04:49:03.812 STDOUT terraform:       + argo-workflows     = "argo-workflows"
04:49:03.812 STDOUT terraform:       + argocd             = "argocd"
04:49:03.812 STDOUT terraform:       + elasticsearch      = "elasticsearch"
04:49:03.813 STDOUT terraform:       + goldilocks         = "goldilocks"
04:49:03.813 STDOUT terraform:       + grafana            = "grafana"
04:49:03.813 STDOUT terraform:       + jaeger             = "jaeger"
04:49:03.813 STDOUT terraform:       + jaeger_demo        = "jaeger-demo"
04:49:03.813 STDOUT terraform:       + jenkins            = "jenkins"
04:49:03.813 STDOUT terraform:       + kibana             = "kibana"
04:49:03.813 STDOUT terraform:       + kubeshark          = "kubeshark"
04:49:03.813 STDOUT terraform:       + loki-stack         = "loki-stack"
04:49:03.813 STDOUT terraform:       + prometheus         = "prometheus"
04:49:03.813 STDOUT terraform:     }
04:49:03.813 STDOUT terraform:   + node_security_group_arn                       = (known after apply)
04:49:03.813 STDOUT terraform:   + node_security_group_id                        = (known after apply)
04:49:03.813 STDOUT terraform:   + r53_zone_id                                   = (known after apply)
04:49:03.813 STDOUT terraform:   + r53_zone_name          
04:49:03.813 STDOUT terraform:                        = "sbx-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
04:49:03.813 STDOUT terraform:   + vpc_id                                        = "vpc-1234"
```
